[{"venue": "Stage B", "start_date": "2022-06-02 21:00:00", "end_date": "2022-06-03 00:00:00", "title": "Life Of Riley Ceilidh Dance", "speaker": "Lucy Rogers", "description": "Life of Ceilidh - Celtic Country Dancing band. \r\nOpen to all.  Come open EMF's Music schedule on B Stage from 9pm. "}, {"venue": "Stage A", "start_date": "2022-06-03 10:15:00", "end_date": "2022-06-03 10:50:00", "title": "Opening Ceremony", "speaker": "EMF Team", "description": "The ceremony in which we open the event"}, {"venue": "Stage C", "start_date": "2022-06-03 11:00:00", "end_date": "2022-06-03 11:20:00", "title": "2500 nerds, one pathetic robot", "speaker": "Chris Stubbs & Dom Tag", "description": "The technical trials and tribulations of trying to allow 2500 nerds to remotely drive a pathetically inadequate robot around a field. \r\nWe cover all the do’s and don’ts of creating an adorable yet woefully inadequate rover. \r\nWe’ll then talk about how we "}, {"venue": "Stage B", "start_date": "2022-06-03 11:00:00", "end_date": "2022-06-03 11:30:00", "title": "Using computers to cheat at maths", "speaker": "Damian Bevan", "description": "Mathematicians of yesteryear, with limited access to computing, solved difficult problems by a combination of genius, vivid imaginations and hard work.\r\n\r\nIn those days, human 'computers' were used to calculate and tabulate the solutions to maths problems"}, {"venue": "Stage A", "start_date": "2022-06-03 11:00:00", "end_date": "2022-06-03 11:30:00", "title": "A brief history of Time Zones and Daylight Saving Time", "speaker": "John Dalziel", "description": "Spring Forward, Fall Back... but why? Take a trip from Railway Time to the Olson database, as we explore the strange history of Time Zones and Daylight Saving Time."}, {"venue": "Stage C", "start_date": "2022-06-03 11:30:00", "end_date": "2022-06-03 12:20:00", "title": "The Aragoscope: optics without lenses or mirrors", "speaker": "Simon Jelley", "description": "Imaging sub-millimeter features from 250m away using only a hard disc as a lens. The Aragosope is a simple diffractive telescope achieving high resolution imaging without mirrors or lenses. NASA funded an exploration of the concept for a giant space teles"}, {"venue": "Stage A", "start_date": "2022-06-03 11:40:00", "end_date": "2022-06-03 12:10:00", "title": "How to get money from fruit machines with and without cheating.", "speaker": "Tony Goacher", "description": "Over the years thieves have used many different ways of getting cash out of fruit machines. This talk examines the methods and how machine manufacturers have adapted to prevent attacks. \r\n\r\nAlso discussed are manufacturer software issues and oversights th"}, {"venue": "Stage B", "start_date": "2022-06-03 11:40:00", "end_date": "2022-06-03 12:10:00", "title": "Fill Your Home with Obsolete Technology: Rare Book Collecting 101", "speaker": "Laura Massey", "description": "Many people believe that books are becoming obsolete, and that rare book libraries have little to contribute to modern society. Others love books, but may not consider themselves \"real collectors\" because they don't fit the image presented in popular cult"}, {"venue": "Stage B", "start_date": "2022-06-03 12:20:00", "end_date": "2022-06-03 12:50:00", "title": "Why do researchers get 'hackers' so wrong, and why we should be worried about the police's response?", "speaker": "Dr Shane Horgan, Dr Sarah Anderson, and Dr Ben Collier", "description": "In this presentation, two criminologists and one sociologist reflect on why criminology and sociology often get ‘hacking’ very wrong - and on the challenges we faced trying to get it (a bit more) right. \r\n\r\nWe draw on ongoing research into how involvement"}, {"venue": "Stage A", "start_date": "2022-06-03 12:20:00", "end_date": "2022-06-03 12:50:00", "title": "The Parables of the Bird Poo, Vibrators, and Chemical Weapons: what hazardous waste can tell us about sustainable development.", "speaker": "Jelly", "description": "Starting with a brief introduction to the concept of Sustainability and the Sustainability Triangle (Environmental, Economic, & Social Aspects), and introducing my background (exploring the contradictions between being an environmental activist and a chem"}, {"venue": "Stage C", "start_date": "2022-06-03 12:30:00", "end_date": "2022-06-03 13:30:00", "title": "Lightning Talks Friday", "speaker": "Lightning Talks", "description": "Placeholder for the third Lightning Talks session"}, {"venue": "Stage A", "start_date": "2022-06-03 13:00:00", "end_date": "2022-06-03 13:40:00", "title": "From Theorems to Serums, From Cryptology to Cosmology ... and The Simpsons", "speaker": "Simon Singh", "description": "Join popular science and maths writer, Simon Singh, on a whistle-stop tour through two decades of his bestselling books. Fermat’s Last Theorem looks at one of the biggest mathematical puzzles of the millennium; The Code Book shares the secrets of cryptolo"}, {"venue": "Stage B", "start_date": "2022-06-03 13:00:00", "end_date": "2022-06-03 13:30:00", "title": "Computer Art from the 1960s until now", "speaker": "Pita Arreola", "description": "The V&A’s digital art collection is one of the largest and most comprehensive of its kind, comprising two-thousand works dating from the 1960s to today. Early works include pieces by pioneering artists Vera Molnár, Frieder Nake and Manfred Mohr, who first"}, {"venue": "Stage C", "start_date": "2022-06-03 13:40:00", "end_date": "2022-06-03 14:20:00", "title": "Adventures with Home Energy Monitoring (with a Raspberry Pi & many Arduinos)", "speaker": "Lee V", "description": "After building a DIY solar hot water panel in 2010, I wanted hard data to see how well it performed. So commenced a long, epic journey of Arduinos, Raspberry Pi's, sensors, servers and low power radios. \r\nLater adding ‘real’ PV solar panels (needing elect"}, {"venue": "Stage B", "start_date": "2022-06-03 13:40:00", "end_date": "2022-06-03 14:10:00", "title": "Algorithmic patterns - a long history", "speaker": "Alex McLean", "description": "Creative coding practices like live coding/algorave are often described by the media as being of the future. For example in 2019, wired magazine introduced live coding with the headline “DJs of the future don’t spin records, they write code”, despite publ"}, {"venue": "Stage A", "start_date": "2022-06-03 13:50:00", "end_date": "2022-06-03 14:20:00", "title": "Hacking train tickets for fun, but not for profit", "speaker": "Hugh Wells", "description": "We take a scenic tour through the origins of the UK train ticket, from the original BR specification in the 1980s through to modern replacements like mTickets, eTickets and ITSO. \r\n\r\nThis is just a detour though, and we'll focus on the 'orange ticket' (RS"}, {"venue": "Stage B", "start_date": "2022-06-03 14:20:00", "end_date": "2022-06-03 14:50:00", "title": "The Highest Energy  Machine on the Earth  to Solve the Biggest Puzzles of the Universe", "speaker": "Alexander Belyaev", "description": "The largest and the highest energy scientific device  - the Large Hadron Collider (LHC) is currently in operation at CERN.\r\nThis machine is  unique  in many respects:\r\n - It is the most powerful microscope, which can  probe the  distance one million times"}, {"venue": "Stage C", "start_date": "2022-06-03 14:30:00", "end_date": "2022-06-03 15:00:00", "title": "The Life of Geoff - our autonomous 4WD rover who nearly became a South African Nurse.", "speaker": "Lincoln & Chris Barnes (Team Robotmad)", "description": "Geoff, an autonomous 4WD robot, was conceived at the beginning of 2018 with the specific goal of roaming around the EMF campsite. While he did make an appearance that year, RGB lights dazzling in the dark, our ambitions for autonomy were thwarted.  Howeve"}, {"venue": "Stage A", "start_date": "2022-06-03 14:30:00", "end_date": "2022-06-03 14:50:00", "title": "How I Fight the Doomscroll and Get Out of the Social Media Refresh Loop", "speaker": "Matt Gray", "description": "We've all found ourself doomscrolling, and fighting against social network's barrage of extra things in our newsfeed and notifications to keep us there for longer. It's not good use of time, energy and mental bandwith, and hell in my case the habitual ref"}, {"venue": "Stage A", "start_date": "2022-06-03 15:00:00", "end_date": "2022-06-03 15:30:00", "title": "Hovering Rockets", "speaker": "James Macfarlane", "description": "The speaker works for a small company in the UK who have developed a VTVL (Vertical Take-off, Vertical Landing) rocket, also known as a hopper or lander. This started as a student / hobby project and is now receiving funding from the European Space Agency"}, {"venue": "Stage B", "start_date": "2022-06-03 15:00:00", "end_date": "2022-06-03 15:30:00", "title": "3615 Love by PAMAL_Group", "speaker": "Caroline Zahnd", "description": "PAMAL_Group is a European artistic group, composed of artists, media theorists, curators-restorers and engineers.\r\n\r\nTheir artwork \"3615 Love\" will be installed at EMF 2022. \r\n\r\nPAMAL_Group creates its own works from digital artworks that have disappeared"}, {"venue": "Stage C", "start_date": "2022-06-03 15:10:00", "end_date": "2022-06-03 15:40:00", "title": "Product Launch: Chocolate Synthbox Sound synthesizer ", "speaker": "Rob Miles", "description": "It's not every day that you get the chance to attend the unveiling of a device that will change the face of music as we know it. Unfortunately, this is not one of those occasions. But if you come along you will find out a bit about making sounds with Pure"}, {"venue": "Stage A", "start_date": "2022-06-03 15:40:00", "end_date": "2022-06-03 16:10:00", "title": "Introduction to the Demoscene", "speaker": "Crypt", "description": "The demoscene is a strange geek subculture, dedicated to making great digital art and making computers doing things they were never designed to do.  At EMF, we have the Field-FX village, which  will spend the weekend showcasing the best of the demoscene. "}, {"venue": "Stage B", "start_date": "2022-06-03 15:40:00", "end_date": "2022-06-03 16:10:00", "title": "Dave Cranmer talks about nervoussquirrel.com and how to get paid to make things", "speaker": "Dave Cranmer", "description": "Delighted to announce that the Ore-Some Xylophone will be making its UK debut at EMF 2022!\r\n\r\nCome and see the electromechanical xylophone that generates truly random compositions by measuring the radioactivity of a lump of uranium ore. You can turn the h"}, {"venue": "Stage C", "start_date": "2022-06-03 15:50:00", "end_date": "2022-06-03 16:10:00", "title": "Refurbishing a 1970's Scanning Electron Microscope (SEM)", "speaker": "Andy Whyte, Jason Evans", "description": "I inherited an SEM from my dad,  and ended up linking up with some of the original engineers from Cambridge Instruments (who pioneered Scanning Electron Microscope design) to get it working.\r\n\r\nThey helped me a great deal and I tried to capture the whole "}, {"venue": "Stage B", "start_date": "2022-06-03 16:20:00", "end_date": "2022-06-03 16:50:00", "title": "An introduction to building your own digital audio effects", "speaker": "Cutlasses (Scott Pitkethly)", "description": "An introduction to getting started designing and building your own audio DSP processors for guitar pedals, eurorack modules and other similar style projects using modern microcontrollers. \r\n\r\nCovering the very basics of digital audio, microcontrollers, au"}, {"venue": "Stage A", "start_date": "2022-06-03 16:20:00", "end_date": "2022-06-03 16:40:00", "title": "Open Garden, Mesh networks, and how it helped me protest safer", "speaker": "Gustavo El Khoury Seoane", "description": "Imagine this: you're a Venezuelan student activist, and you're protesting to get your university the budget it so desperately needs and the powers that be mercilessly cut away. But then, your government disrupts phone coverage in the area to discourage pr"}, {"venue": "Stage C", "start_date": "2022-06-03 16:20:00", "end_date": "2022-06-03 16:40:00", "title": "From Parsnips to Palm Trees: the Economics of Stardew Valley", "speaker": "Hannah Cameron", "description": "You're in the big city, working so hard that it's all you know, and when your grandpa leaves you his farm you quit that city life taking all your hard-earned life savings of 500 bucks (about 2 jars of mayonnaise) with you. How you afforded the bus there i"}, {"venue": "Stage A", "start_date": "2022-06-03 16:50:00", "end_date": "2022-06-03 17:20:00", "title": "Building weird games controllers.", "speaker": "ben Everard", "description": "Games controllers are boring. They have the same few buttons in the same place.\r\n\r\nIt doesn't have to be this way. In this talk, I'll go through how I've made controllers that are different and unique.\r\n\r\nThese controllers are quick and easy to make with "}, {"venue": "Stage C", "start_date": "2022-06-03 16:50:00", "end_date": "2022-06-03 17:30:00", "title": "Wearable live captions (making mask wearing more accessible for those who are hard of hearing)", "speaker": "Jo Franchetti", "description": "During the pandemic we've all been feeling pretty isolated, and we've all been doing our best and wearing masks. But what if everyone wearing masks cuts off your ability to converse? My lil mum relies on lip reading and clear sounds to understand what peo"}, {"venue": "Stage B", "start_date": "2022-06-03 17:00:00", "end_date": "2022-06-03 17:30:00", "title": "Running around in circles and why it isn't as useless as you first expect.", "speaker": "James Arthur", "description": "I run Parkrun (some weeks), and am trying to run the alphabet. While running one week I realised that every parkrun course is the same. They are all basically one of a few mathematical objects, the integers or some pair, tuple or quadruple of integers. We"}, {"venue": "Stage A", "start_date": "2022-06-03 17:30:00", "end_date": "2022-06-03 18:00:00", "title": "Emotions, what's up with those?", "speaker": "David MacIver", "description": "About four years ago I realised I was miserable and that I should probably do something about that, so I did what any self-respecting nerd would do and read a tonne of books to figure out how emotions worked (I did also go to therapy, but the books were m"}, {"venue": "Stage C", "start_date": "2022-06-03 17:40:00", "end_date": "2022-06-03 18:20:00", "title": "Sense without sight: blind navigation for sighted people", "speaker": "Sai", "description": "Learn to sense the world without your eyes — hear walls and corridors, sense doorways and ceilings with your hair, feel nearby walls and people on your skin. (Yes, literally.) As a blind person, I do this every day; this is your opportunity to learn how t"}, {"venue": "Stage B", "start_date": "2022-06-03 17:40:00", "end_date": "2022-06-03 18:20:00", "title": "An Evil Maid's Dream: Windows Boot Security was Broken Anyway", "speaker": "Zammis Clark", "description": "A deep dive into the Windows boot process, its security mechanisms, and the security issues that have been found within the last 10 years, culminating in a single bug (found in August 2021, fixed in January 2022) that can bypass all such security mechanis"}, {"venue": "Stage A", "start_date": "2022-06-03 18:10:00", "end_date": "2022-06-03 18:40:00", "title": "Soft Electronics", "speaker": "Helen Leigh", "description": "This talk explores the softer side of electronics, from electronic embroidery and e-textiles to soft robotics and flexible PCB design. We will take a look at some of the exciting technologies in this field, including industrial machines that embroider tra"}, {"venue": "Stage C", "start_date": "2022-06-03 18:30:00", "end_date": "2022-06-03 19:00:00", "title": "Receiving amateur radio satellite beacons", "speaker": "Damian Bevan", "description": "Low Earth Orbit (LEO) satellites are commonplace in day-to-day commercial applications such as fixed and mobile broadband provision, navigation, earth sensing etc. \r\n\r\nIn this talk we learn more about LEO satellites and how to listen to 'CW' (Morse code) "}, {"venue": "Stage B", "start_date": "2022-06-03 18:30:00", "end_date": "2022-06-03 19:00:00", "title": "Captain Proton's Ukulele for Dummies", "speaker": "Peter Thorley", "description": "A short talk on how to build, play and perform with a ukulele illustrated with geeky songs based on my love of physics and electronics. Advice for joining bands and getting free beer at a pub open mic night for the musically inept. I'll bring along my hom"}, {"venue": "Stage A", "start_date": "2022-06-03 18:50:00", "end_date": "2022-06-03 19:20:00", "title": "Ship vs Oil Rig", "speaker": "Nigel Worsley", "description": "When a 3,500 ton ship tries to be in the same place as an oil rig then it is safe to say that someone is going to have a bad day. Nobody was injured and no oil was spilled, so it didn't make the news and was just an insurance job - a very BIG insurance jo"}, {"venue": "Stage A", "start_date": "2022-06-03 19:30:00", "end_date": "2022-06-03 20:00:00", "title": "Not another sex robot talk!", "speaker": "Kate Devlin", "description": "Back at Electromagnetic Field 2016, I talked about something that was starting to get wider media attention: an  up-close-and-personal glimpse of the future involving sex, tech, AI and robots. I then returned in 2018 to debunk the headline myths and updat"}, {"venue": "Stage C", "start_date": "2022-06-03 19:30:00", "end_date": "2022-06-03 21:03:00", "title": "[Film] General Magic", "speaker": "PJ Evans", "description": "Friday 19:30 - 1h 33m - 12A\r\n\r\nSpecial Event: Directors Sarah Kerruish & Matt Maude will join us online to introduce the film and answer your questions after the screening.\r\n\r\nHow do you think that smartphone got in your pocket? If you follow the history,"}, {"venue": "Stage B", "start_date": "2022-06-03 20:00:00", "end_date": "2022-06-03 20:45:00", "title": "[Music] The Memepunks", "speaker": "The Memepunks", "description": "A live mashup covers band with a lively stage presence and impressive catalogue of original arrangements. Played in realtime, we use a number of custom electronic devices to achieve the sounds of popular anthems from the '80s, 90s and beyond on a fusion o"}, {"venue": "Stage A", "start_date": "2022-06-03 20:10:00", "end_date": "2022-06-03 21:00:00", "title": "Shader Showdown and Byte Battle", "speaker": "Reality  Crossley", "description": "A competitive coding performance where 2 coders will compete each other to create visuals set to fun demoscene music.  They will compete in 2 formats:\r\n\r\nShader Showdown: Competitors use graphics shaders to produced procedurally generated images including"}, {"venue": "Stage B", "start_date": "2022-06-03 21:00:00", "end_date": "2022-06-03 22:00:00", "title": "[Music] Look Mum No Computer", "speaker": "Sam Battle", "description": "Look Mum No Computer is a live electronic artist who takes his home made machines on the road to play loud music. Usually found in his studio cooking up a new instrument and writing new songs, he avoids computers like the plague (unless he’s got to send a"}, {"venue": "Stage B", "start_date": "2022-06-03 22:15:00", "end_date": "2022-06-03 22:45:00", "title": "[Music] Palindrones", "speaker": "Palindrones", "description": "A multi-instrumental duo based in South East London who write expansive musical landscapes, mixing pounding, uplifting beats and blistering synth drones, with a lush ambience and a dusting of haunting, dreamy vocals. We both play synths and percussion wit"}, {"venue": "Stage C", "start_date": "2022-06-03 23:00:00", "end_date": "2022-06-04 00:45:00", "title": "[Film] Hackers", "speaker": "PJ Evans", "description": "Friday 23:00 - 1h 45m - 12\r\n\r\nGeek classic Hackers returns after four years. Legendary hacker Zero Cool and his friends have been framed by The Plague, who has unleashed a computer virus that could cause an environmental disaster. Pursued by the Secret Se"}, {"venue": "Stage B", "start_date": "2022-06-03 23:15:00", "end_date": "2022-06-04 00:00:00", "title": "[Music] Vieon", "speaker": "Vieon", "description": "Vieon is the electronic musical project of Matt Wild, based in Coventry, UK. Expanding to a live four-piece including VJ Adrian Thompson, sound engineer Stephen Dorphin and keyboardist Ricardo Autobahn (of Cuban Boys and Eurovision fame), our sound is ins"}, {"venue": "Stage B", "start_date": "2022-06-04 00:15:00", "end_date": "2022-06-04 01:00:00", "title": "[Music] Polyop: An Audio-Visual Voyage", "speaker": "Polyop", "description": "Continuing in the tradition of sonic-fiction, POLYOP fuse live electronic music performance with sci-fi mythologies to create an immersive audio-visual voyage. Follow the omnipotent Creator on his pilgrimage through distant reaches of an alternate polyhed"}, {"venue": "Stage B", "start_date": "2022-06-04 01:15:00", "end_date": "2022-06-04 02:00:00", "title": "[Music] Gravity Synth - Friday Night Edition", "speaker": "Leon Trimble", "description": "The Gravity Synth is a musical instrument combining a desktop version of the instrumentation used to detect gravitational waves, and a modular synthesiser. The experimentation with the scientific and musical equipment has been a collaboration between rese"}, {"venue": "Stage B", "start_date": "2022-06-04 10:00:00", "end_date": "2022-06-04 10:30:00", "title": "The Tokenisation of the Commons", "speaker": "James Smith", "description": "Hundreds of years ago, people didn’t own land. Instead it was used by all, as a communal good. Then some bright spark decided that ownership was a better idea, and “enclosure” carved up the country with walls and fences, and solidified class divisions tha"}, {"venue": "Stage A", "start_date": "2022-06-04 10:00:00", "end_date": "2022-06-04 10:30:00", "title": "Psychological party tricks", "speaker": "Emma McDonald", "description": "As a psychologist, I often get asked one of two questions: Can you read my mind? Are you analysing me?* \r\n\r\nBut Psychology is not entirely useless; by studying the mind and brain, we can learn a lot about how we work. In this talk, I will go through some "}, {"venue": "Stage C", "start_date": "2022-06-04 10:00:00", "end_date": "2022-06-04 10:30:00", "title": "Material Science: Steel for BattleBots (and Robot Wars, of course) ", "speaker": "Jennifer Herchenroeder", "description": "I am the captain of a BattleBots team, currently showing on Discovery Channel in the US and streaming worldwide. Among the many engineering challenges we face building combat robots, material selection is critical. I don't only mean choosing steel over al"}, {"venue": "Stage B", "start_date": "2022-06-04 10:40:00", "end_date": "2022-06-04 11:10:00", "title": "The future of invention", "speaker": "Chris Wright", "description": "Advances in NLP and machine learning are allowing automatic processing of knowledge. An untapped potential of this revolution is the ability to change how people come up with ideas and solve problems. \r\n\r\nPeople tend to solve problems in linear ways. If m"}, {"venue": "Stage C", "start_date": "2022-06-04 10:40:00", "end_date": "2022-06-04 11:10:00", "title": "Two Tin Cans - Printmaking in a phonebox", "speaker": "Suzie Devey", "description": "Suzie is the creator of Two Tin Cans, a printmaking studio in a telephone box which will be at EMF!\r\n\r\nTwo Tin Cans is a K6 style phonebox... with a difference! Inside the phonebox is a tiny printmaking studio includes printing blocks created by Suzie Dev"}, {"venue": "Stage A", "start_date": "2022-06-04 10:40:00", "end_date": "2022-06-04 11:10:00", "title": "Solar Punks... ASSEMBLE! Data from domestic solar panels and batteries", "speaker": "Terence Eden", "description": "Just how effective are solar panels and domestic batteries? Here's several years of *real* data from UK-based solar panels.\r\n\r\nCan you generate *all* the electricity which your home will consume? \r\nWhat happens to the electricity you sell to your neighbou"}, {"venue": "Stage C", "start_date": "2022-06-04 11:20:00", "end_date": "2022-06-04 11:50:00", "title": "Making in Margate", "speaker": "Matt Mapleston", "description": "Margate, Kent is a phoenix rising from the ashes of Britain's great seaside institutions. This one-time jewel had been abandoned to decay and deprivation. The last 6 or 7 years have seen green shoots of regeneration begun by Turner Contemporary Gallery an"}, {"venue": "Stage A", "start_date": "2022-06-04 11:20:00", "end_date": "2022-06-04 11:50:00", "title": "Improve your Memory ( in your head not in your computer) ", "speaker": "Emma McDonald", "description": "Unfortunately, you cannot pop magic Limitless style pills to improve your memory. But with a bit of understanding about how our memory works, we can introduce techniques that will help us remember important and even unimportant information. In this talk, "}, {"venue": "Stage B", "start_date": "2022-06-04 11:20:00", "end_date": "2022-06-04 11:50:00", "title": "Wearable Fire Art", "speaker": "jeffmakes", "description": "Fire has been a ubiquitous technology for countless millennia, finding applications across many problem domains. This talk describes the development of a new product that brings fire into the wearable technology arena. \r\n\r\nWearable technology is often lim"}, {"venue": "Stage C", "start_date": "2022-06-04 12:00:00", "end_date": "2022-06-04 12:30:00", "title": "ME++ The Data Within - data ethics, ballet, brainwaves, and AR", "speaker": "Genevieve Smith-Nunes & Alex Shaw", "description": "Exploring data ethics through creative immersive tools with brainwave, and motion capture data. Is there a difference in sense of self (identity) between the human and the virtual? How does sharing your personal biometric data make you feel? How can biome"}, {"venue": "Stage B", "start_date": "2022-06-04 12:00:00", "end_date": "2022-06-04 12:20:00", "title": "The SEGA Dreamcast: Frankenstein's Console", "speaker": "Alex Rea", "description": "The SEGA Dreamcast was released nearly 25 years ago, but was discontinued after only 18 months on sale in the west, and was such a commercial failure that SEGA never made another console. Despite this short lifetime, a homebrew community formed, has not g"}, {"venue": "Stage A", "start_date": "2022-06-04 12:00:00", "end_date": "2022-06-04 12:40:00", "title": "Learning from accidents: an introduction to railway signalling in the UK", "speaker": "Robin Wilson", "description": "Trains are one of the safest ways to travel, but it hasn't always been like that. In this talk I will introduce the basics of railway signalling, and look at how it has evolved over time - often in response to accidents and near-misses. You will find out "}, {"venue": "Stage B", "start_date": "2022-06-04 12:30:00", "end_date": "2022-06-04 13:00:00", "title": "Astro Pi Mark II - how to send a Raspberry Pi from a factory in Wales to the International Space Station ", "speaker": "Richard Hayler", "description": "In 2015, as part of British astronaut Tim Peake’s Principia mission, the Raspberry Pi Foundation worked with the UK and European Space Agencies to send two Raspberry Pi computers to the International Space Station. Since then, these Astro Pis have run tho"}, {"venue": "Stage C", "start_date": "2022-06-04 12:40:00", "end_date": "2022-06-04 13:10:00", "title": "An engineer's guide to grief", "speaker": "Ella Barrington", "description": "I am an engineer, so when my partner died when I was 24 and I found myself in the midst of grief, I discovered that the best way of dealing with it was to use the engineering approach that was already ingrained in me. “An engineer's guide to grief” if you"}, {"venue": "Stage A", "start_date": "2022-06-04 12:50:00", "end_date": "2022-06-04 13:10:00", "title": "asdkfldsalkasdf: Keysmashes, Sexuality and Mathematical Randomness", "speaker": "May", "description": "Keysmashes are way of expressing emotions through spamming random letters on a keyboard but what do they actually mean? How random is a keysmash? Where do keysmashes come from? What can we learn about a person from their keysmashes? This talk is a beginne"}, {"venue": "Stage A", "start_date": "2022-06-04 13:20:00", "end_date": "2022-06-04 13:50:00", "title": "The curious design of the Apollo Guidance Computer.", "speaker": "Steve Baines", "description": "The Apollo Guidance Computer (AGC) was a critical element in the success of the Apollo Moon landing programme, and was one of the first digital computers to use the then new technology of integrated circuits.\r\n\r\nBy modern standards, its design has many un"}, {"venue": "Stage C", "start_date": "2022-06-04 13:20:00", "end_date": "2022-06-04 14:20:00", "title": "Lightning Talks Saturday", "speaker": "Lightning Talks", "description": "Placeholder for the second Lightning Talks session"}, {"venue": "Stage B", "start_date": "2022-06-04 13:50:00", "end_date": "2022-06-04 14:30:00", "title": "What remains? Stories from a radical undertaker", "speaker": "Rupert Callender", "description": "Ru Callender has been a self proclaimed, self taught Radical undertaker for the past 23 years, and draws upon a diverse range of influences in his work, such as rave culture, punk DIY, crop circles and performance art and ritual magic. He had written an a"}, {"venue": "Stage A", "start_date": "2022-06-04 14:00:00", "end_date": "2022-06-04 14:50:00", "title": "Being YouTubers!", "speaker": "James Bruton, Matt Denton, Ruth Amos", "description": "How we got onto YouTube as Makers and a realistic look at what it's like to be content creators including some of the pitfalls, with examples of 'how going viral can be a curse'.\r\n\r\nParticipants are:\r\n\r\nJames Bruton\r\nMatt Denton\r\nRuth Amos"}, {"venue": "Stage C", "start_date": "2022-06-04 14:30:00", "end_date": "2022-06-04 15:00:00", "title": "Computational Alchemy", "speaker": "Matt Carroll", "description": "A few years ago at a virtual conference I related my story of blowing up a BBC Micro B's power supply and alluded to the idea that it was (for totally anecdotal reasons) due to dark, occult forces.\r\n\r\nThe subsequent year I realised that the best defense a"}, {"venue": "Stage B", "start_date": "2022-06-04 14:40:00", "end_date": "2022-06-04 15:10:00", "title": "Inside Datatrak: resurrecting a radio navigation network", "speaker": "Phil Pemberton", "description": "It began with buying an old Datatrak navigation receiver, and ended in the reverse-engineering of an entire navigation system -- one that had been dead since 2014. A demonstration of how a 1980s navigation receiver was reverse-engineered to component leve"}, {"venue": "Stage A", "start_date": "2022-06-04 15:00:00", "end_date": "2022-06-04 15:30:00", "title": "The Atomic Gardener", "speaker": "Sarah Angliss", "description": "This talk tells the extraordinary story of Muriel Howorth - science fiction author, choreographer, gardener and amateur nuclear physicist. Far away from the cares of Britain's Atomic Weapons Establishment, Howorth worked from her home in Eastborne in the "}, {"venue": "Stage C", "start_date": "2022-06-04 15:10:00", "end_date": "2022-06-04 15:40:00", "title": "How not to start a Hackspace", "speaker": "Alistair MacDonald", "description": "Are you interested in forming a hackspace or creating a FabLab? Are you interested in learning from the successes and failures or others? This talk will give insight into how we did it, how you can do it as well, and help you avoid the pitfalls we found a"}, {"venue": "Stage B", "start_date": "2022-06-04 15:20:00", "end_date": "2022-06-04 15:40:00", "title": "Some Useful Maths", "speaker": "Alexander Bolton", "description": "4 lightning talks about different mathematical subjects\r\n1. *A tip for when to take risks in board games and in life*. I will give an insight into how Google's AlphaGo AI chooses its next move, and give an example of a game that seems biased against you, "}, {"venue": "Stage A", "start_date": "2022-06-04 15:40:00", "end_date": "2022-06-04 16:10:00", "title": "A Crash Course In Railway Safety", "speaker": "Anthony Williams", "description": "Travelling by rail in most of the world is one of the safest forms of transport you can take, and in the UK even minor collisions make the news. But it wasn't always quite that way...\r\n\r\nThis talk will be a potted history of the safety of the railways in "}, {"venue": "Stage B", "start_date": "2022-06-04 15:50:00", "end_date": "2022-06-04 16:20:00", "title": "Automated Science at Sea - The Mayflower Autonomous Ship", "speaker": "James Sutton", "description": "The Mayflower Autonomous Ship is a fully autonomous, AI powered research vessel, that will at the time of this talk will hopefully have completed its primary mission to cross the Atlantic from Plymouth UK, to Plymouth Massachusetts without any human inter"}, {"venue": "Stage C", "start_date": "2022-06-04 15:50:00", "end_date": "2022-06-04 16:20:00", "title": "Aerials: Generating music from network systems", "speaker": "Daniel Jones", "description": "I make generative systems that translate patterns, processes and data into dynamic musical forms, illuminating hidden structures from the world around us. This has involved creating immersive sound installations that respond to weather patterns, bacterial"}, {"venue": "Stage A", "start_date": "2022-06-04 16:20:00", "end_date": "2022-06-04 16:50:00", "title": "The Digi-Gurdy: An electronic MIDI enabled Hurdy Gurdy project", "speaker": "John Dingley", "description": "The hurdy-gurdy is an ancient musical instrument (10th century) with drones and melody strings bowed by a rotating wheel, played by pressing keys which contact them at different points. It featured in TV series such as “Black Sails” and “Walking Dead” as "}, {"venue": "Stage B", "start_date": "2022-06-04 16:30:00", "end_date": "2022-06-04 16:50:00", "title": "Launching a Rocket, Suspended by a Balloon (Rockoon), from the Stratosphere", "speaker": "DAVID JOHNSON", "description": "The B2Space satellite launch solution is based on the “rockoon” concept (rocket + balloon), and will comprise of a stratospheric balloon, which will lift a self-operative platform from which the launcher is deployed. A solid propellant rocket will deliver"}, {"venue": "Stage C", "start_date": "2022-06-04 16:30:00", "end_date": "2022-06-04 17:00:00", "title": "I gave up investment banking to become a digital artist", "speaker": "Jonathan Hogg", "description": "As cringe as I often find it talking about myself, this seems to be the thing about my background that amazes people I mention it to.\r\n\r\nI spent 6 years failing to do a CS PhD, co-founded a (failed) fin-tech startup and watched the 2008 credit crunch from"}, {"venue": "Stage A", "start_date": "2022-06-04 17:00:00", "end_date": "2022-06-04 17:30:00", "title": "A journey through philosophy: exploring metaphysics via memes and a sprinkling of pop culture.", "speaker": "Kara Langford ", "description": "Over my time in academia, I've endured a number of existential crises whilst learning about the concepts within philosophy that are required in order to undertake academic research. I figured that, if I'm going to spend the rest of my life constantly ques"}, {"venue": "Stage B", "start_date": "2022-06-04 17:00:00", "end_date": "2022-06-04 17:20:00", "title": "Why doesn't the Universal Translator translate Klingon insults? A nerd's introduction to machine translation", "speaker": "Danielle Saunders", "description": "In recent years automatic machine translation has dramatically improved in performance, with the availability of neural networks and huge amounts of data. Why does it work, and more importantly, when does it break? What kinds of language are machines terr"}, {"venue": "Stage C", "start_date": "2022-06-04 17:10:00", "end_date": "2022-06-04 17:40:00", "title": "Hacking Google with Poetry – what are words worth anyway?", "speaker": "Pip Thornton", "description": "How does Google earn its money? And how has the company become such a central player in controversies such as biased search results and fake news stories? The answer is simple: Google makes its money by selling words to advertisers. Artist and researcher "}, {"venue": "Stage B", "start_date": "2022-06-04 17:30:00", "end_date": "2022-06-04 18:20:00", "title": "1-hour* Computing Degree", "speaker": "Sean Lucent", "description": "Computing is a very broad field with many diverse topics; is it possible to cover everything for a typical computing degree in just one hour*?! Let's find out!\r\n\r\nI will speed talk through everything from bits and bytes to blockchains and beyond. I'll (sh"}, {"venue": "Stage A", "start_date": "2022-06-04 17:40:00", "end_date": "2022-06-04 18:10:00", "title": "Anatomy 102: Is that normal!?!", "speaker": "Kim M", "description": "Interactive talk on anatomy and diagnostic imaging from the perspective of a radiographer. Using powerpoint presentation and anonymised images from real life cases (plus some funny fakes).\r\n- what is diagnostic imaging?\r\n- how to understand CT/xray images"}, {"venue": "Stage C", "start_date": "2022-06-04 17:50:00", "end_date": "2022-06-04 18:20:00", "title": "Pee is Powerful! From artwork to new world infrastructures with ALICE", "speaker": "Julie Freeman, Rachel Armstrong, Ioannis Ieropoulos", "description": "Join the conversation with Professors Rachel Armstrong and Ioannis Ieropoulos, and artist Julie Freeman, to hear about how the ALICE artwork is a springboard for thinking about a new infrastructure that encompasses nomadic lifestyles, smart plumbing, reso"}, {"venue": "Stage B", "start_date": "2022-06-04 18:30:00", "end_date": "2022-06-04 19:00:00", "title": "Hacking the Radio Spectrum with GNU Radio", "speaker": "Dave Rowntree", "description": "The most profound change in radio technology in 100 years is happening now.  Radios are transforming from the spaghetti of mind-bogglingly complex electronics into simple (but very fast) digitisers, and all the hard work is being done in software. Hence t"}, {"venue": "Stage C", "start_date": "2022-06-04 18:30:00", "end_date": "2022-06-04 19:00:00", "title": "Sifteo Cubes: Resurrecting a legend", "speaker": "Dr Mike Reddy", "description": "In 2009 a TED Talk by David Merrill showed small interactive tiles that talked to each other; an MIT “what if” project from their media lab. Little IoT devices that brought computers, toys and board game pieces together. In 2011(version one) and 2012 (ver"}, {"venue": "Stage A", "start_date": "2022-06-04 18:30:00", "end_date": "2022-06-04 19:20:00", "title": "Speed 3: Cruise Control", "speaker": "Cybergibbons", "description": "When I first watched Hackers in 1998, the idea of being able to remotely control ships seemed rather fanciful. After working on container ships as an engineer in the mid-2000s, it seemed every more unlikely. We didn't have a full-time Internet connection "}, {"venue": "Stage A", "start_date": "2022-06-04 19:30:00", "end_date": "2022-06-04 20:00:00", "title": "Rob Manuel of @fesshole and b3ta talks about trying to entertain people with comedy bots", "speaker": "Robert D Manuel", "description": "For the last 5 years I've been trying to entertain people on Twitter with various comedy bots from Clickbait Robot, and Yoko Ono Bot to the horrible monster hit Fesshole (currently 350,000 followers when Rob typed this.)\r\n\r\nIn this talk Rob will tell some"}, {"venue": "Stage C", "start_date": "2022-06-04 19:30:00", "end_date": "2022-06-04 22:19:00", "title": "[Film] Interstellar", "speaker": "PJ Evans", "description": "Saturday 19:30 - 2h 49 - 12\r\n\r\nSpecial Event: Visual special effect artist Eugénie von Tunzelmann answers your questions about her work on Interstellar before the screening.\r\n\r\nChristopher Nolan’s classic comes to Electromagnetic Field. A dying Earth is b"}, {"venue": "Stage B", "start_date": "2022-06-04 20:00:00", "end_date": "2022-06-04 20:45:00", "title": "[Music] Moormur", "speaker": "Moormur", "description": "Moormur is a London based producer/beat maker/self-taught drummer.\r\n\r\nHis work explores rhythms and sounds from all the world, and aims to blend of new and old to create something different.\r\n\r\nThe music is a \"collage\" of samples, field recordings, and sy"}, {"venue": "Stage A", "start_date": "2022-06-04 20:10:00", "end_date": "2022-06-04 21:00:00", "title": "GPT-3 Powerpoint Karaoke", "speaker": "Adam Froggatt, Kate Devlin", "description": "An audience interactive event; where willing volunteers collide with GPT-3 AI to present an informative, intellectual and light-hearted presentation to a receptive crowd. Unfortunately, they don't get to see the presentation before they talk about it!\r\n\r\n"}, {"venue": "Stage B", "start_date": "2022-06-04 21:00:00", "end_date": "2022-06-04 21:45:00", "title": "[Music] Flesh Tetris", "speaker": "Flesh Tetris", "description": "Pop music for unpopular people. Retro SciFi Eurotrash armed to the teeth with barbed pop hooks and weaponised synths. So uncool we're cool."}, {"venue": "Stage B", "start_date": "2022-06-04 22:00:00", "end_date": "2022-06-04 22:30:00", "title": "[Music] Graham Dunning", "speaker": "Graham Dunning", "description": "A new live set recording on-the-fly to cassette tape loops across four tape players. A rough attempt at an analogue emulation of a modern loop pedal, where none of the loops will stay in sync and the sound is degraded and detuned. The set is improvised ar"}, {"venue": "Stage B", "start_date": "2022-06-04 23:00:00", "end_date": "2022-06-05 00:00:00", "title": "[Music] 2xAA - electronic music crafted using Game Boys", "speaker": "2xAA", "description": "2xAA (aka Sam Wray) harnesses the low-fi power of the Nintendo Game Boy and various other portable hardwares to create a flowing electro-house set."}, {"venue": "Stage C", "start_date": "2022-06-04 23:30:00", "end_date": "2022-06-05 00:59:00", "title": "[Film] The Barkley Marathons", "speaker": "PJ Evans", "description": "Saturday 23:30 - 1h 29m - 16+\r\n\r\nOne of those films that slacks your jaw in the first five minutes and then it just gets worse. The Barkley Marathons is a documentary on the now-famous ultramarathon that takes place every year in Tennessee. Participants a"}, {"venue": "Stage B", "start_date": "2022-06-05 00:00:00", "end_date": "2022-06-05 00:45:00", "title": "[Music] Gasman's ZX Spectrum Chiptune Revival", "speaker": "Gasman", "description": "The world's number one ZX Spectrum rock star is ready to don his white suit and keytar for his return to the EMF stage! Gasman delivers upbeat pop anthems, wrapped up in the authentic bleeps and bloops of ZX Spectrum chiptunes to satisfy all your 80s crav"}, {"venue": "Stage B", "start_date": "2022-06-05 01:00:00", "end_date": "2022-06-05 01:30:00", "title": "[Music] Algorave", "speaker": "Alex McLean", "description": "A from-scratch live coding performance, in the classic algorave broken techno style. "}, {"venue": "Stage B", "start_date": "2022-06-05 10:00:00", "end_date": "2022-06-05 10:30:00", "title": "Fluroclock - the clock made from fluorescent tubes", "speaker": "Tom O’Connor and Hugh Wells", "description": "Fluroclock is a 4 digit clock, made using fluorescent tubes. At just under a meter, they're quite a bit bigger than your average 7-segment display! \r\n\r\nWe discuss how we designed and built this clock and how you can do the same. We'll also demonstrate som"}, {"venue": "Stage C", "start_date": "2022-06-05 10:00:00", "end_date": "2022-06-05 10:30:00", "title": "How I set up a CoderDojo and Started a Coding Community in my Town", "speaker": "Caroline Graham", "description": "A talk about how I set up a local CoderDojo club in my small market town; how I gathered together a group of like-minded people to become mentors; how I persuaded the 7-16 year olds of the town to give coding a whirl; how we won over the pensioners' garde"}, {"venue": "Stage A", "start_date": "2022-06-05 10:00:00", "end_date": "2022-06-05 10:30:00", "title": "Announcing the EMF schedule like it's the 80s", "speaker": "Dan Nixon", "description": "A demonstration and discussion around amateur paging. This year I will be providing a pager transmitter at EMF that primarily will announce the talk/event schedule (amongst other things yet to be dreamt up over a pint).\r\n\r\nThis talk will give an overview "}, {"venue": "Stage A", "start_date": "2022-06-05 10:40:00", "end_date": "2022-06-05 11:10:00", "title": "A Life Without Stickers is Possible But Useless", "speaker": "eph ", "description": "Stickers are an essential part of our culture, our values. Stickers are everywhere! But why?\r\n\r\nThis talk will provide serious, evidence-based insights into the newest developments of the evolving discipline „Sticker Research“, including an overview of th"}, {"venue": "Stage B", "start_date": "2022-06-05 10:40:00", "end_date": "2022-06-05 11:10:00", "title": "Rewilding Human-Computer Interaction", "speaker": "Tim Murray-Browne", "description": "I'm an artist creating interactive installations. The hardest part is devising open-ended interaction, spaces that invite people to reveal their authentic selves, and to connect with those around.\r\n\r\nBut trends in technology have gone in the opposite dire"}, {"venue": "Stage C", "start_date": "2022-06-05 10:40:00", "end_date": "2022-06-05 11:10:00", "title": "Landscape of Open Source Databases", "speaker": "Lorna Mitchell", "description": "Every year we collect more data than before, and the tools we use to manage that data are evolving to accommodate our changing needs - but it can be difficult to keep up with all the innovations! This session will give you a tour of what's happening in op"}, {"venue": "Stage A", "start_date": "2022-06-05 11:20:00", "end_date": "2022-06-05 11:50:00", "title": "The Art of Videogame Sound Effects", "speaker": "Cai Jones", "description": "Sound effects are often heard but not explored. In this talk I will explain what goes into the process of creating video game sound effects, the way they impact a scene and how the smallest changes can make a massive difference to video games.\r\n\r\nJoin me "}, {"venue": "Stage C", "start_date": "2022-06-05 11:20:00", "end_date": "2022-06-05 11:50:00", "title": "Making technology deliberately distinguishable from magic: designing the BBC micro:bit", "speaker": "Jonny Austin", "description": "Should we really be trying to make our tech indistinguishable from magic? Is there dark magic in tech? And what does that have to do with a teleporting duck in a classroom?!\r\n\r\nWe often hold creating 'a magical experience' as a key goal for design - it's "}, {"venue": "Stage B", "start_date": "2022-06-05 11:20:00", "end_date": "2022-06-05 11:50:00", "title": "'This is Britain' – British cultural propaganda films of the 1930s-1940s, their creation, and their far-reaching global legacy", "speaker": "Sarah Cole", "description": "In 1939 World War 2 started and the British Council—Britain's shiny new organisation for overseas cultural relations and propaganda—inherited the suddenly-closed tourist board's film-making department. Tourism films are no use in a war, so the Council tur"}, {"venue": "Stage B", "start_date": "2022-06-05 12:00:00", "end_date": "2022-06-05 12:30:00", "title": "Building a copper telephone network at EMF", "speaker": "Matthew Harrold", "description": "An overview of how I went from thinking about bringing a handful of analog telephones, to building a copper telephone network covering most of the EMF festival site. \r\n\r\nI'll be going over the hardware and software I used, what I learned, what I'd do diff"}, {"venue": "Stage A", "start_date": "2022-06-05 12:00:00", "end_date": "2022-06-05 12:40:00", "title": "Hacking Gender: Transition À La Carte", "speaker": "Ryan Castellucci", "description": "What, exactly, does a gender transition involve?\r\n\r\nOver time, it has increasingly become the case that there is no simple answer. The degree to which people can now pick and choose what they want in terms of (de)masculinizing and (de)feminizing effects/p"}, {"venue": "Stage C", "start_date": "2022-06-05 12:00:00", "end_date": "2022-06-05 12:30:00", "title": "Unfinished Projects: Breaking the cycle", "speaker": "Jason Bedard", "description": "A few of us struggle with completing projects. They pile up, often literally. A multitude of unhelpful feelings follow. Project management tools help but never seem to address what really holds us back. We start a new project, and the pattern repeats.\r\n\r\n"}, {"venue": "Stage C", "start_date": "2022-06-05 12:40:00", "end_date": "2022-06-05 13:10:00", "title": "Opening the Door for the Globally Excluded in Tech", "speaker": "Aisha Nasir", "description": "The tech industry is powerful in its control of innovation and economic growth, however its dominance is concentrated in the Western World. The Global Majority have the least presence and involvement in this industry and its impact.\r\n\r\nOver the years I ha"}, {"venue": "Stage B", "start_date": "2022-06-05 12:40:00", "end_date": "2022-06-05 13:10:00", "title": "Art, science, creativity, black holes, roller coasters and robot xylophones", "speaker": "Eugénie von Tunzelmann", "description": "My great passion is the space where art and science crash into each other. From teaching computers to see to simulating black holes in Interstellar, from sewing the contents of my wardrobe to building some of the biggest theme park rides in the world, fro"}, {"venue": "Stage A", "start_date": "2022-06-05 12:50:00", "end_date": "2022-06-05 13:20:00", "title": "Who watches the scooters?", "speaker": "Matthew Garrett", "description": "You put a bunch of scooters online and you have an app that can tell you if you're near one so you can hire it. But what can people do with that knowledge? \r\n\r\nWhat can you figure out if you can track a scooter's position in real time? What insight do you"}, {"venue": "Stage B", "start_date": "2022-06-05 13:20:00", "end_date": "2022-06-05 13:50:00", "title": "On the Fringe of Science. Volume 1", "speaker": "Ian B Dunne", "description": "Some ideas in science last and prove their worth, others are shown by time to be downright dangerous, others are just plain wrong, or quite possibly insane. And then we have the con men and the frauds to deal with. There are just so many things to say.\r\n\r"}, {"venue": "Stage C", "start_date": "2022-06-05 13:20:00", "end_date": "2022-06-05 13:50:00", "title": "Lightning Talks Sunday", "speaker": "Lightning Talks", "description": "Placeholder for the first Lightning Talks session"}, {"venue": "Stage A", "start_date": "2022-06-05 13:30:00", "end_date": "2022-06-05 14:00:00", "title": "Modern Cryptography from Scratch, in Scratch", "speaker": "David Buchanan", "description": "Scratch is a programming environment aimed at children ages 8 to 16. It's simple and easy to learn, but lacks many features that experienced programmers have come to expect, such as version control, bitwise operators, or integers!\r\n\r\nThis talk provides a "}, {"venue": "Stage B", "start_date": "2022-06-05 14:00:00", "end_date": "2022-06-05 14:20:00", "title": "Why you really need to get out more...", "speaker": "Sophie Lovejoy", "description": "I bet you don't have your best ideas sat in front of your screen...\r\n\r\nScience backs up what we know as a fundmental truth - that getting out into nature is good for our wellbeing. You might be surprised just how good. Not only does walking boost creativi"}, {"venue": "Stage C", "start_date": "2022-06-05 14:00:00", "end_date": "2022-06-05 14:20:00", "title": "Ghost in the machine or monkey with a typewriter—generating titles for Christmas research articles in The BMJ using artificial intelligence", "speaker": "Robin Marlow", "description": "A suggestion for a last minute lighting (or other!) talk...\r\nAfter seeing a tweet by jonty about sandwiches, we wanted to determine whether artificial intelligence (AI) could generate plausible and engaging titles for potential Christmas research articles"}, {"venue": "Stage A", "start_date": "2022-06-05 14:10:00", "end_date": "2022-06-05 14:30:00", "title": "Building a Home-Made Enigma Machine", "speaker": "Reuben Binns", "description": "\"The Enigma Machine was an electro-mechanical device used in the mid-20th century to encrypt communications. An ingeniously simple and elegant combination of cogs, wires and lamps, all fitting into a portable case, it provided some of the strongest encryp"}, {"venue": "Stage C", "start_date": "2022-06-05 14:30:00", "end_date": "2022-06-05 15:00:00", "title": "Using Arduinos to Resurrect an Airliner Wing", "speaker": "Chris Lynas", "description": "A section of an airliner wing, born in North Wales and brought up in Toulouse, France and operated in South America, now lives in the Aerospace Bristol museum.\r\n\r\nThis talk shows our experiences with building it into an interactive exhibit explaining how "}, {"venue": "Stage B", "start_date": "2022-06-05 14:30:00", "end_date": "2022-06-05 15:00:00", "title": "The imitation game - using live data feeds from Network Rail to control a model railway", "speaker": "Matthew Macdonald-Wallace", "description": "For years I've dreamed of building a scale model of a large railway station in the UK.\r\n\r\nI've also want to fully automate that layout, running trains in \"real time\" because I like a challenge.\r\n\r\nA few years ago I discovered that Network Rail provide acc"}, {"venue": "Stage A", "start_date": "2022-06-05 14:40:00", "end_date": "2022-06-05 15:10:00", "title": "Why is it so hard to do nice things, that make a difference, with other people?", "speaker": "Dr Kim Foale", "description": "On the surface of it it seems simple: tech and maker types have skills they enjoy using, and community groups have unmet needs that could be helped by these skills. Why then does it feel so incredibly hard to make these collaborations happen in reality? A"}, {"venue": "Stage C", "start_date": "2022-06-05 15:10:00", "end_date": "2022-06-05 15:40:00", "title": "Fixing climate change: finance, science, policy & data", "speaker": "Gavin Starks", "description": "Stories from the frontline of those trying to redirect the next $3.6 trillion of global investment into demonstrably carbon net-zero outcomes.\r\n\r\nThis decade is arguably the 'last roll of the dice' when it comes to acting on climate.\r\n\r\nWe've spent the la"}, {"venue": "Stage B", "start_date": "2022-06-05 15:10:00", "end_date": "2022-06-05 15:30:00", "title": "Why YOU should write a Gameboy Emulator", "speaker": "Tim Jacobs", "description": "Writing a gameboy emulator is probably the most rewarding hobbyist project I've ever embarked on. Not only is the process educational and enlightening, but it's hard to describe the satisfaction of playing Tetris on an emulator that *you wrote*.\r\n\r\nAn emu"}, {"venue": "Stage A", "start_date": "2022-06-05 15:20:00", "end_date": "2022-06-05 15:40:00", "title": "Anti-surveillance Knitting", "speaker": "Ottilia Westerlund", "description": "Is it possible to trick a facial detection algorithm with... yarn? In this talk I will explore the possibilities and process of making a knitted garment to trick facial detection into seeing faces that aren't really there. This talk will go through how th"}, {"venue": "Stage B", "start_date": "2022-06-05 15:40:00", "end_date": "2022-06-05 16:30:00", "title": "Skylar MacDonald's Fact Machine", "speaker": "Skylar MacDonald", "description": "I love facts. Or, more accurately, I love using facts to prove myself right. Join me and my PowerPoint to find out why cancer causes mobile phones (not the other way around), how stingy single people are about wine, and why Italian yoghurt adverts are a f"}, {"venue": "Stage A", "start_date": "2022-06-05 15:50:00", "end_date": "2022-06-05 16:20:00", "title": "oh heck another badge talk", "speaker": "Bob (on behalf of team:badge)", "description": "We go through the last 4 years of badge development, leak the 2020 badge design and give a run-through of the development process of the TiDAL badge"}, {"venue": "Stage C", "start_date": "2022-06-05 15:50:00", "end_date": "2022-06-05 16:20:00", "title": "Who if not you: A guide to community", "speaker": "Trans Tech Tent (Abby Simmons / Jane Fleetwood)", "description": "\"Tech companies don't tell you this but you can just repair phones, I've repaired 458 phones\"\r\n\r\nBuilding a tech mutual aid from scratch and getting over your fear of failure, a tour of the highs and lows of building a local community, and why it's worth "}, {"venue": "Stage A", "start_date": "2022-06-05 16:30:00", "end_date": "2022-06-05 17:00:00", "title": "How I'm building my monstrous electric motorcycle from hacked scrap EV & Hybrid parts. ", "speaker": "Russell Couper", "description": "Using end of life or 'scrap' EV & Hybrid parts and opensource firmware I'm making an electric motorbike, having got tired of making dirty diesel ones! \r\n\r\nThe scrapyards are now filled with slightly broken EVs and Hybrid cars, and almost no one knows what"}, {"venue": "Stage C", "start_date": "2022-06-05 16:30:00", "end_date": "2022-06-05 17:00:00", "title": "Demystifying the USB Type-C connector", "speaker": "Tyler Ward", "description": "The USB type-C connector has become the universal connector for modern devices. It is able to transmit USB, video, power, and more, Often doing several of these at the same time. All, while maintaining backwards compatibility with older hardware using rel"}, {"venue": "Stage B", "start_date": "2022-06-05 16:40:00", "end_date": "2022-06-05 17:10:00", "title": "PickMeUp And Hold Me Tight, or How I ended up war dialling the UK payphone estate ", "speaker": "Sam Machin", "description": "Back in 2018 I got involved in an arts project called Pick Me Up and Hold Me Tight, by ZU-UK.\r\nThe goal was to raise awareness of male suicide by making all 34,000 UK pay phones ring at 11am on New Years Day.\r\n\r\nInitially I backed their crowd funder as it"}, {"venue": "Stage A", "start_date": "2022-06-05 17:10:00", "end_date": "2022-06-05 17:40:00", "title": "On taking your daft ideas seriously (or, how we accidentally made an art robot business)", "speaker": "Richard Sewell", "description": "I’ve made some installations and art robots over the years, getting gradually more ambitious, and somehow this has turned into a job and a robot company, Air Giants.\r\n\r\nThis talk is about that process, and about how taking a daft idea more seriously than "}, {"venue": "Stage B", "start_date": "2022-06-05 17:20:00", "end_date": "2022-06-05 17:50:00", "title": "Field-FX Demo Show ", "speaker": "Reality Crossley & Alex Shaw ", "description": "The results and winners of the Field-FX weekend demo competitions.  We will show all the best demos and other productions and highlights from all the best submitted over the course of the festival."}, {"venue": "Stage C", "start_date": "2022-06-05 17:20:00", "end_date": "2022-06-05 17:50:00", "title": "Fashion-tech Advice from a Farm Boy and a Comp Sci Geek ", "speaker": "Shannon Hoover and Sydney Pratte", "description": "Fashion tells a story of who we are, expressing the opinions and positions of both wearers and designers. Fashion-tech -- fashion embedded with programmable electronics -- offers more dynamic expressions for fashion. This talk will first discuss the impor"}, {"venue": "Stage A", "start_date": "2022-06-05 17:50:00", "end_date": "2022-06-05 18:20:00", "title": "London Underground open data: much more than you ever wanted to know", "speaker": "eta", "description": "Over the past year or so, I've become way too interested in tracking London Underground trains with greater precision than anyone else so far. Transport for London provides an API (\"TrackerNet\") to get departure boards for all the stations -- but (ab)usin"}, {"venue": "Stage C", "start_date": "2022-06-05 18:00:00", "end_date": "2022-06-05 18:30:00", "title": "Machine learning with a pile of matchboxes", "speaker": "Matthew Scroggs", "description": "In the 1960s, Donald Michie built MENACE: the matchbox educable noughts and crosses engine. MENACE was built from 304 matchboxes and is one of the earliest examples of a machine learning algorithm: initially, MENACE is a very bad noughts and crosses but o"}, {"venue": "Stage B", "start_date": "2022-06-05 18:00:00", "end_date": "2022-06-05 18:30:00", "title": "See Change, Change the World: Imaging Earth with CubeSats", "speaker": "Tanya Harrison", "description": "Planet Labs, PBC operates the largest constellation of Earth-imaging satellites in history, collecting data of the entire landmass of our world on a near-daily basis with over 200 CubeSats. Planetary Scientist Dr. Tanya Harrison will discuss these CubeSat"}, {"venue": "Stage A", "start_date": "2022-06-05 18:30:00", "end_date": "2022-06-05 19:20:00", "title": "EMF 2022 Infrastructure Review", "speaker": "David Croft et al", "description": "Members of the EMF infrastructure teams (network, power, lighting, video, telephony) will give some insight into how we delivered these services this year. We'll talk about our workflow, some of the new services we've delivered, and share some statistics "}, {"venue": "Stage C", "start_date": "2022-06-05 18:40:00", "end_date": "2022-06-05 19:10:00", "title": "What if apps logged into you, instead of you logging into apps?", "speaker": "Chris Swan", "description": "As a hacker and engineer I've been interested in identity and privacy since the dawn of the Internet and the online services it's enabled. For the past year I've been helping to build an open source platform, which inverts the usual model by giving everyb"}, {"venue": "Stage B", "start_date": "2022-06-05 18:40:00", "end_date": "2022-06-05 19:10:00", "title": "Life lessons from Laughing Babies and Murderous Philosophers. ", "speaker": "Caspar Addyman", "description": "What is the meaning of life? I once wrote to every philosopher in the UK to ask them. Their answers were meagre and dispiriting. One even included a death threat.\r\n\r\nSince then I've moved on study why babies have such a great time being babies. Anyone who"}, {"venue": "Stage A", "start_date": "2022-06-05 19:30:00", "end_date": "2022-06-05 20:00:00", "title": "Closing Ceremony", "speaker": "EMF Team", "description": "The ceremony in which we close the event"}, {"venue": "Stage C", "start_date": "2022-06-05 20:30:00", "end_date": "2022-06-05 21:10:00", "title": "[Film] The Speed Cubers", "speaker": "PJ Evans", "description": "Sunday 20:30 - 40m - PG\r\n\r\nHow long did it take you to solve your first Rubik’s Cube? Did you ever? A speed cuber can do it in about eight seconds. This heartwarming documentary follows two of the greatest ‘cubers’ in history during the build up to the wo"}, {"venue": "Stage B", "start_date": "2022-06-05 20:30:00", "end_date": "2022-06-05 21:30:00", "title": "2xAA: writing chiptune using nanoloop", "speaker": "MR P D Hutchinson", "description": "2xAA explains his setup and demos how to write music on a Game Boy using nanoloop 2, a 16 step sequencer. THIS IS NOT A WORKSHOP, but if you fancy following along - download the demo ROM at from https://nanoloop.com/two and run in a GBA emulator. Bring he"}, {"venue": "Stage B", "start_date": "2022-06-05 21:30:00", "end_date": "2022-06-05 22:30:00", "title": "[Music] Cutlasses", "speaker": "Cutlasses", "description": "A live performance from Cutlasses (AKA Scott Pitkethly) using an orchestra of handmade instruments and effects. Eschewing the oscillators of a traditional synthesiser for the resonances of homemade electro-acoustic sound sources and piezo based noise boxe"}, {"venue": "Stage C", "start_date": "2022-06-05 21:30:00", "end_date": "2022-06-05 23:36:00", "title": "[Film] Sneakers", "speaker": "PJ Evans", "description": "Sunday 21:30 - 2h 6m - 12\r\n\r\nOur second geek classic of Electromagnetic Field. A hacker heads a group of specialists who test the security of various San Francisco companies. National Security Agency officers ask them to steal a newly invented decoder. Th"}]