[{"venue": "Stage B", "start_date": "2024-05-30 16:00:00", "end_date": "2024-05-30 18:00:00", "title": "Stage Volunteer Training", "speaker": "EMF Stage Team", "description": "A training session for people who want to volunteer for stage & video roles, you'll learn how to do basic sound & video mixing, how the cameras work, and how to control the lighting."}, {"venue": "Stage B", "start_date": "2024-05-30 19:30:00", "end_date": "2024-05-30 21:30:00", "title": "The EMF Ceilidh with the Bunny Eye Ceilidh Band", "speaker": "EMF Music", "description": "Get ready to kick up your heels and dance the night away at our lively ceilidh! Our friendly caller will guide you through the steps, whether you’re a seasoned dancer or a first-timer. Expect jigs, reels, and maybe even a waltz or two!\r\nWhat it's all abou"}, {"venue": "Stage C", "start_date": "2024-05-30 20:00:00", "end_date": "2024-05-30 22:20:00", "title": "Dune (1984)", "speaker": "EMF Film", "description": "A rare change to see the far superior adaptation of Frank Herbert's classic novel by professional  oddball David Lynch. From Kyle MacLachlan's scenery-tearing performance, the 'huh?' apperance of Patrick Stewart to the sheer madness of Sting's fight scene"}, {"venue": "Stage B", "start_date": "2024-05-31 09:00:00", "end_date": "2024-05-31 10:00:00", "title": "Stage Volunteer Training", "speaker": "EMF Stage Team", "description": "A training session for people who want to volunteer for stage & video roles, you'll learn how to do basic sound & video mixing, how the cameras work, and how to control the lighting."}, {"venue": "Stage A", "start_date": "2024-05-31 10:00:00", "end_date": "2024-05-31 10:30:00", "title": "Opening Ceremony", "speaker": "EMF Team", "description": "The ceremony in which we open the festival. Hello!"}, {"venue": "Stage C", "start_date": "2024-05-31 11:00:00", "end_date": "2024-05-31 11:30:00", "title": "How to go solar off grid in the UK. ", "speaker": "andy fletcher", "description": "How to specify and deploy an off-grid system in the UK.  \r\n\r\nCovers power requirement calculations and performance tradeoffs in the real world. How to handle low production near winter solstice. Touches on battery selection, care and feeding and dimension"}, {"venue": "Stage A", "start_date": "2024-05-31 11:00:00", "end_date": "2024-05-31 11:30:00", "title": "How to escape from a WW2 POW Camp", "speaker": "James Burt", "description": "During WW2, British plane crews sometimes found themselves imprisoned behind enemy lines. With only light punishments for escape attempts, some of these prisoners worked on incredible schemes to get back home. This illustrated talk will talk about these e"}, {"venue": "Stage B", "start_date": "2024-05-31 11:00:00", "end_date": "2024-05-31 11:30:00", "title": "Sending text messages through space", "speaker": "Damian Bevan", "description": "When we’re out and about, text messages (and also voice calls, mobile data etc.) sent and received through our everyday smartphones are all routed through fixed land-based ‘cell tower’ antennas no more than a few km distant, which form what we might term "}, {"venue": "Stage A", "start_date": "2024-05-31 11:40:00", "end_date": "2024-05-31 12:10:00", "title": "Seams Like Magic: A primer on sewing basics", "speaker": "Claire Phillips", "description": "At EMF 2022 I ran a drop in sewing workshop. Whilst it was popular, one question that I didn't have time to answer properly was the broad: \"I want to make my own clothes: where do I start?\"\r\n\r\nI'd like to answer just that question in this talk. I'll cover"}, {"venue": "Stage B", "start_date": "2024-05-31 11:40:00", "end_date": "2024-05-31 12:10:00", "title": "The Tiny Tool Kit Manifesto", "speaker": "Drew  Batchelor", "description": "What is the best tiny toolkit for hacking in a field, fixing robots in the wild and repairing products for friends?\r\nWe've spent years creating our own bespoke tiny toolkits, with tiny tools, that work for our own specific needs as makers and hackers.\r\nIn"}, {"venue": "Stage C", "start_date": "2024-05-31 11:40:00", "end_date": "2024-05-31 12:10:00", "title": "Run your own fucking infrastructure - 2024 edition", "speaker": "Elmar mc.fly Lecher", "description": "In a 2012 talk about running your own infrastructure I made some predictions on the future and made some claims. A long time has passed and let's see what came true and what was not so correct. \r\n\r\nAfter that talk we also started building our own infrastr"}, {"venue": "Stage A", "start_date": "2024-05-31 12:20:00", "end_date": "2024-05-31 13:00:00", "title": "The Last Miles of The Internet", "speaker": "James Harrison", "description": "How does your home router get to the \"internet\" in the UK? With the rise of alternative fibre networks, and major operators finally deploying fibre to the home, the copper cables that have connected us since the 1900s are being rapidly replaced with fibre"}, {"venue": "Stage B", "start_date": "2024-05-31 12:20:00", "end_date": "2024-05-31 12:50:00", "title": "How to map caves", "speaker": "Footleg", "description": "Caves present a challenging environment to survey and map. Conditions are often wet, muddy and involve confined spaces. This talk will look at how the technology we have developed has changed how we measure and create maps of cave systems. From traditiona"}, {"venue": "Stage C", "start_date": "2024-05-31 12:20:00", "end_date": "2024-05-31 12:40:00", "title": "Small Town, Big Ideas - The challenges of building a rural Makerspace", "speaker": "Matthew Macdonald-Wallace", "description": "It turns out that building a Hackspace in a rural area is really hard.\r\n\r\nFrom the name of the group causing security concerns to finding a venue and members, a lot of the challenges that are presented in rural environments don't really seem to be present"}, {"venue": "Stage C", "start_date": "2024-05-31 12:50:00", "end_date": "2024-05-31 13:20:00", "title": "Whispered Secrets: Building An Open-Source Tool To Live Transcribe & Summarize Conversations", "speaker": "John Sandall", "description": "Are you secretly a spy and/or passionate about open-source? Maybe you don't trust a cloud-hosted service with your highly classified information, or perhaps you like to build things for yourself. In this light-hearted talk, you will learn how to make a re"}, {"venue": "Stage B", "start_date": "2024-05-31 13:00:00", "end_date": "2024-05-31 13:30:00", "title": "GPS time, leap seconds, and a clock that's always right", "speaker": "Tim Jacobs", "description": "It sounds easy enough: build a clock that always shows the correct local time, no matter where you take it. Mobile phones can sort-of do this, but they manage by listening to the cell towers, so this won't work everywhere. \"Radio controlled\" clocks just l"}, {"venue": "Stage A", "start_date": "2024-05-31 13:10:00", "end_date": "2024-05-31 13:40:00", "title": "Endocrine Biohacking - Friends of Blåhaj and beyond", "speaker": "a[gk]i|ab+y", "description": "Biohacking for girls, gays, theys, and undisclosed entitites.\r\n\r\nWhy biohacking is good, cool, and a human right\r\nA brief history of biohacking and why endocrine biohacking is so cool\r\nhow to manage your own endocrine care\r\nhow to access managed endocrine"}, {"venue": "Stage C", "start_date": "2024-05-31 13:30:00", "end_date": "2024-05-31 13:50:00", "title": "Fighting Allergies with Pollen Forecasting", "speaker": "Scott Street", "description": "Many people rely on pollen forecasts to know when their allergies are likely to cause trouble. So when the main source of them in Finland scaled back after losing funding, a replacement was needed. Hear about the process of starting at zero knowledge of p"}, {"venue": "Stage B", "start_date": "2024-05-31 13:40:00", "end_date": "2024-05-31 14:10:00", "title": "Let's Party Like It's 1994 - Re-Imagining How to Find Stuff Online", "speaker": "Martin Hamilton", "description": "Internet search results were a toxic hellstew of ads, SEO spam, content farms and misinformation/disinformation even before the arrival of Large Language Models like ChatGPT in 2023. In 2024 nearly half the world’s population votes in elections that will "}, {"venue": "Stage A", "start_date": "2024-05-31 13:50:00", "end_date": "2024-05-31 14:20:00", "title": "Working Amateur Satellites on a Budget", "speaker": "Heather Nickalls", "description": "Always thought it was expensive to receive signals from Space? In this talk I will go through the simple homebrew antennas and cheap (around £10) receivers that you can use to get such diverse things as weather satellite images, pictures from the ISS, rec"}, {"venue": "Stage C", "start_date": "2024-05-31 14:00:00", "end_date": "2024-05-31 14:30:00", "title": "Making Music with Hair", "speaker": "Chris Bartholomew", "description": "Combining his deep interest in the biology of hair with generative music systems, Chris will give you a an insight into how he has brought the two fields together. \r\n\r\nAfter a chance introduction to an Austrailian biology student in 2022, Chris and Jay ha"}, {"venue": "Stage B", "start_date": "2024-05-31 14:20:00", "end_date": "2024-05-31 14:40:00", "title": "Mothers' G(q)uilt: An exploration of mothers' experiences through an interactive quilt", "speaker": "Sophia Komninou", "description": "This is a talk about how we combined textiles, electronics and storytelling to provide a platform for people to share experiences. \r\nFor this project, we wanted to explore more the findings of previous research around the guilt mothers feel when feeding t"}, {"venue": "Stage A", "start_date": "2024-05-31 14:30:00", "end_date": "2024-05-31 15:10:00", "title": "Live tour of the Boulby Underground Laboratory - a special science facility 1.1km underground!", "speaker": "Jonny Gutteridge, Will Furnell, Boulby Team", "description": "A rare live two way link with the Boulby Underground Laboratory, where the Boulby team will give us a tour of the underground facilities that include a Mars Yard, where real (and LEGO) Mars rovers are tested, multiple Dark Matter research experiments, und"}, {"venue": "Stage C", "start_date": "2024-05-31 14:40:00", "end_date": "2024-05-31 15:10:00", "title": "Remote controlled Chaos Cart - How to motorise trash.", "speaker": "Hendrik, Gwen and Callum", "description": "Using a fad of the 2010s and the UK's most popular river dweller the Leeds hackspace has combined 2 hoverboard wheels with a shopping trolley to create a monstrosity. Armed with a PA system, rally lights, under glow and 2 car horns it’s the perfect centre"}, {"venue": "Stage B", "start_date": "2024-05-31 14:50:00", "end_date": "2024-05-31 15:20:00", "title": "How Roadies became Network Engineers ", "speaker": "Nicholas Whitehead", "description": "Over the past five decades, the concert & live event industry has undergone a dramatic transformation into a major sector of the economy, with the production playing a pivotal role. Artists and their shows constantly seek the latest lighting & video techn"}, {"venue": "Stage C", "start_date": "2024-05-31 15:20:00", "end_date": "2024-05-31 16:00:00", "title": "From Haunted Karaoke to the Humour Feature: an Exploration of Auto-Generated Comedy", "speaker": "Ben Below and Matthew Wearden ", "description": "In a world where large language models like GPT and Gemini are becoming more and more ubiquitous, what does this mean for comedy? If computers getting things obviously wrong is a factor in their comedy value, do the improvements in generative AI take us i"}, {"venue": "Stage A", "start_date": "2024-05-31 15:20:00", "end_date": "2024-05-31 15:40:00", "title": "The Best Word In Morse Code", "speaker": "Ayliean Macdonald", "description": "After accidentally becoming fluent in Morse Code I have waded through a sea of dots and dashes to find THE best word in Morse Code (ok, maybe its just my personal favourite - but I have reasons to back it up!)\r\nOf course, as a mathematician, I couldn't le"}, {"venue": "Stage B", "start_date": "2024-05-31 15:30:00", "end_date": "2024-05-31 16:00:00", "title": "The coffee fix: Why it's so hard to pull a great espresso, and how to improve your shots", "speaker": "Damian Bramanis", "description": "Pulling a shot of espresso sounds so simple - just pump some water through a bed of coffee grounds. But while it sounds simple, many things can go wrong. What ends up in the cup can too easily end up bitter, sour, watery, chalky, harsh, or flat.\r\n\r\nSo how"}, {"venue": "Stage A", "start_date": "2024-05-31 15:50:00", "end_date": "2024-05-31 16:30:00", "title": "A Short History of Electric Shocks", "speaker": "Tim Hunkin", "description": "This talk is about our delight, awe and fear of electricity and its effects on the human body. It charts our changing relationship with it from the 18th century to today. I particularly love the 18th century gentlemen scientists with their electrical ente"}, {"venue": "Stage C", "start_date": "2024-05-31 16:10:00", "end_date": "2024-05-31 16:40:00", "title": "Lightning talks (Friday)", "speaker": "Thor", "description": "Short 10 minute talks on any topic"}, {"venue": "Stage B", "start_date": "2024-05-31 16:10:00", "end_date": "2024-05-31 16:40:00", "title": "Photobombed by a Robot Arm in space", "speaker": "Richard Hayler", "description": "Get ready to take a trip into space.  We'll be travelling 400km up to the International Space Station, to take a look at Earth through the lens of the Astro Pi computers that were sent there in 2020. \r\n\r\nThis talk will focus on what has been learnt from y"}, {"venue": "Stage A", "start_date": "2024-05-31 16:40:00", "end_date": "2024-05-31 17:10:00", "title": "The XZ backdoor - what, why, and how?", "speaker": "Matthew Garrett", "description": "Earlier this year, a developer was trying to benchmark a database. But something was wrong - SSH was taking up too much CPU time in the background. This accidental observation led to the discovery of an audacious attempt to introduce a backdoor that would"}, {"venue": "Stage B", "start_date": "2024-05-31 16:50:00", "end_date": "2024-05-31 17:20:00", "title": "Engineering lessons from a 300 year-old poem  ", "speaker": "Tim Ruffles", "description": "There are three things about this poem that will surprise you. First: though written 300 years ago, it contains superb guidance on being an engineer or maker of any kind. Second: you’ll immediately recognise some of its best lines. Third: its author was a"}, {"venue": "Stage C", "start_date": "2024-05-31 16:50:00", "end_date": "2024-05-31 17:20:00", "title": "Downpour & more: how and why to make creative tools", "speaker": "v buckenham", "description": "I recently released Downpour, an app that anyone can use to make little games on their phone. And before that I made Cheap Bots, Done Quick, a website that anyone could use to make a Twitterbot on their computer. And so unsurprisingly I am a big advocate "}, {"venue": "Stage A", "start_date": "2024-05-31 17:20:00", "end_date": "2024-05-31 17:50:00", "title": "How I found a Roman Villa (or temple)", "speaker": "Jo Skerry", "description": "The Roman archaeological record is far from complete; There are hundreds of high status Roman buildings yet to be located in Britain. \r\n\r\nI was volunteering in the ambulance service during COVID when I was given a piece of Roman pottery by a patient. With"}, {"venue": "Stage C", "start_date": "2024-05-31 17:30:00", "end_date": "2024-05-31 18:00:00", "title": "CHERI and Arm Morello: mitigating the terrible legacy of memory-safety security issues, in practice at scale", "speaker": "Peter Sewell", "description": "Computing is riddled with security vulnerabilities, many of which arise from memory safety issues.  Conventional hardware architectures and the C/C++ codebase are chronically prone to exploitable errors - a 75-year-old problem at the heart of computing.  "}, {"venue": "Stage B", "start_date": "2024-05-31 17:30:00", "end_date": "2024-05-31 18:00:00", "title": "unexpected coffee: a dive into industrial coffee machines", "speaker": "Hetti", "description": "A bit more than two years ago, someone contacted our Hackspace asking if we would be interested in an electronically defective, but probably repairable industrial coffee vending machine. An industrial coffee machine with a touchscreen and cocoa toppings? "}, {"venue": "Stage A", "start_date": "2024-05-31 18:00:00", "end_date": "2024-05-31 18:30:00", "title": "Coding Beyond the Screen: The unique challenges of programming massive public laser displays", "speaker": "Seb Lee-Delisle", "description": "Join BAFTA winning digital artist Seb Lee-Delisle in this engaging talk about his life and work over the past few years. \r\n\r\nAlthough Seb is known for his large and spectacular outdoor light and laser shows, he is fundamentally a coder. In this fun keynot"}, {"venue": "Stage B", "start_date": "2024-05-31 18:10:00", "end_date": "2024-05-31 18:40:00", "title": "How to make a puzzlehunt", "speaker": "Sarah Binney", "description": "What do semaphore, octopuses, Scrabble, rotary telephones and Microsoft Paint have in common? If you've been to previous EMFs, you might recognise these as some of the themes for our puzzles!\r\n\r\nWe are Dreamcat and we are a group of friends who made our f"}, {"venue": "Stage C", "start_date": "2024-05-31 18:10:00", "end_date": "2024-05-31 18:40:00", "title": "Spotting Seals with Sonar (and A.I.)", "speaker": "Benjamin Blundell", "description": "Tidal energy is one potential source of green energy but the impact of placing large turbines on the seabed is not fully understood. In particular, how are sea mammals coping with such changes in their environment? Do we need to put automatic mitigations "}, {"venue": "Stage A", "start_date": "2024-05-31 18:40:00", "end_date": "2024-05-31 19:20:00", "title": "Is everything difficult, or is it just me?", "speaker": "Jo Franchetti", "description": "It isn't just you.\r\n\r\nThere are so many pressures on us, not only from our jobs and industry, but from the state of society, politics and the economy as a whole.\r\n\r\nJoin me on a joyful journey through the alphabet of overwhelm, we’ll cover Anxiety, Burnou"}, {"venue": "Stage B", "start_date": "2024-05-31 18:50:00", "end_date": "2024-05-31 19:20:00", "title": "What the Frack? The inside view of unconventional oil production.", "speaker": "John Thurmond", "description": "Few things are as polarizing today as the production of oil, and unconventional production (including 'fracking') is even more controversial. Whether you're for it or (more likely) against it, it's well worth knowing what is actually involved in making it"}, {"venue": "Stage C", "start_date": "2024-05-31 18:50:00", "end_date": "2024-05-31 19:20:00", "title": "The Auto Plane Spotter: a robot to point at aeroplanes", "speaker": "Chris Lynas", "description": "As a semi-professional plane spotter when I hear or see an aircraft fly over I will sometimes point at it. But I can't always tell if there's an aircraft flying over, and I can't be awake 24/7 so I miss some, which I find unacceptable. \r\n\r\nEnter the auto "}, {"venue": "Stage B", "start_date": "2024-05-31 19:30:00", "end_date": "2024-05-31 20:00:00", "title": "When a tree falls in the forest.... does it cause a fire?", "speaker": "Laura James", "description": "Overstory uses satellite imagery plus machine learning to understand individual trees - at scale. I'll talk about how we do this, some of the practical challenges of remote sensing and earth observation, and how we translate this into real world preventio"}, {"venue": "Stage A", "start_date": "2024-05-31 19:30:00", "end_date": "2024-05-31 20:10:00", "title": "Foxdog Studios: Robo Bingo", "speaker": "FoxDog Studios", "description": "Bingo meets tech in an interactive, smartphone powered comedy act like no other.  Experience a whole new side of bingo created by Foxdog Studios (Lloyd & Pete) and their robotic bingo mascot, Mr Bing. Expect chaos, games and laughs. Join the fun without l"}, {"venue": "Stage C", "start_date": "2024-05-31 19:30:00", "end_date": "2024-05-31 20:00:00", "title": "The Journey is the Reward: Discovering the Fun in small Production Runs", "speaker": "bleeptrack", "description": "bleeptrack is an award winning creative technologist from Germany, working in the fields of generative art and digital fabrication. Twice a year, she sends out unique generative art pieces to her patreons and supporters. These pieces vary drastically in t"}, {"venue": "Stage C", "start_date": "2024-05-31 20:30:00", "end_date": "2024-05-31 20:50:00", "title": "Hackers Introduction with Iain Softley", "speaker": "Iain Softley", "description": "Before our 29th Anniversary screening of the EMFCamp favourite Hackers, director Iain Softley will introduce the film. Bring your best cosplay game and stick around afterwards for a full Q&A."}, {"venue": "Stage C", "start_date": "2024-05-31 20:50:00", "end_date": "2024-05-31 22:35:00", "title": "Hackers - Special Event", "speaker": "EMF Film", "description": "On Friday we welcome Hackers director Iain Softley and vfx artist Paul Franklin to Stage C for a special 29th Anniversary (yes, off-by-one error) showing of this legendary movie. Iain will introduce the film and following will be a Q&A with Iain and Paul "}, {"venue": "Stage B", "start_date": "2024-05-31 21:00:00", "end_date": "2024-05-31 21:45:00", "title": "Sugar Darling", "speaker": "EMF Live Music", "description": "Sugar Darling are four wacky lads making a racket and rocking your socks off!! Often described as: \"literally the greatest band of ALL TIME\", they are sure to get your bowels moving and your toes a-tapping.\r\n\r\nGet ready for monkey business such as their h"}, {"venue": "Stage B", "start_date": "2024-05-31 22:00:00", "end_date": "2024-05-31 22:50:00", "title": "Mother Vulture", "speaker": "EMF Live Music", "description": "High energy turbo-rock with an infamously chaotic live show.\r\n\r\nFuriously hard working and proudly DIY, South-West noisemakers Mother Vulture continue to push the boundaries of what is possible as an unsigned and independent band having sold out headline "}, {"venue": "Stage C", "start_date": "2024-05-31 22:35:00", "end_date": "2024-05-31 23:15:00", "title": "Hackers Q&A", "speaker": "Iain Softley & Paul Franklin", "description": "Following the screening of Hackers, directory Iain Softley and vfx artist Paul Franklin (creator of Hacker's 'city of text') will be joined on stage by author and Empire Magazine editor-at-large Helen O'Hara. Find out about how the film was made and it's "}, {"venue": "Stage B", "start_date": "2024-05-31 23:00:00", "end_date": "2024-05-31 23:55:00", "title": "Obscenity State", "speaker": "EMF Live Music - Performance", "description": "Obscenity State is an audiovisual artist/electronic music producer and musician that has been performing her shows across London and Europe at venues such as Corsica Studios, Fire and Iklectik.\r\n\r\nThe driving rhythms and expansive sound design of her musi"}, {"venue": "Stage C", "start_date": "2024-05-31 23:30:00", "end_date": "2024-06-01 01:05:00", "title": "Micro Men", "speaker": "EMF Film", "description": "A rare change to see this classic comedy-drama. In the early 1980s, Clve Sinclair, an eccentric inventor, aims to dominate the nascent home computer market with his low-priced ZX range. Frustrated by Clive's temper and stubboness, employee Chris Curry dec"}, {"venue": "Stage B", "start_date": "2024-06-01 00:00:00", "end_date": "2024-06-01 00:55:00", "title": "Hoffman - Amiga Set", "speaker": "Hoffman", "description": "Hoffman has been making music and DJing for over 30 years. Cutting his teeth with ProTracker as a teenager and fed on a diet of rave music, it was only a matter of time before his love of coding would result in the creation of PT-1210, a piece of software"}, {"venue": "Stage B", "start_date": "2024-06-01 01:00:00", "end_date": "2024-06-01 01:30:00", "title": "Dave Cranmer - Very good acid house played via a musical pig", "speaker": "EMF Live Music", "description": "Dave spends most of his time in his workshop making things, which offers a perfect opportunity to spend days and nights exploring new music.\r\n\r\nA particular interest in building synthesisers has developed alongside a passion for electronic sounds, and thi"}, {"venue": "Stage A", "start_date": "2024-06-01 09:00:00", "end_date": "2024-06-01 10:00:00", "title": "Stage Volunteer Training", "speaker": "EMF Stage Team", "description": "A training session for people who want to volunteer for stage & video roles, you'll learn how to do basic sound & video mixing, how the cameras work, and how to control the lighting."}, {"venue": "Stage B", "start_date": "2024-06-01 09:00:00", "end_date": "2024-06-01 09:30:00", "title": "Synthercise - the dance fitness experience", "speaker": "zooleika (aka Jo Walsh)", "description": "Get ready to enjoy Synthercise, a dance fitness experience like no other - think \"Zumba, but with chiptunes\". 8-bit sounds, 90s oriented tunes.  \r\n\r\nCome dressed in comfortable clothes, and shoes suitable for dancing and working out in - ready to shake yo"}, {"venue": "Stage A", "start_date": "2024-06-01 10:00:00", "end_date": "2024-06-01 10:30:00", "title": "Adventures with Iridium ", "speaker": "Blue and Q", "description": "How do you transmit data when there’s 205,000 people trying to access the same mobile network in a field? Satellites, of course! After facing dilemmas of tracking the staff shuttles at a major UK festival, we decided to look at other options and discovere"}, {"venue": "Stage C", "start_date": "2024-06-01 10:00:00", "end_date": "2024-06-01 10:20:00", "title": "From Tax Law to Tangible Dreams: An Accidental Maker's Journey", "speaker": "Shan Sun", "description": "I was trained as a tax lawyer and data scientist as a profession but I always wanted to build. I attended the my first EMF and was hugely inspired by the participants and presenters I met. \r\n\r\nThe following year, with the support of an EU innovation grant"}, {"venue": "Stage B", "start_date": "2024-06-01 10:00:00", "end_date": "2024-06-01 10:30:00", "title": "OGRE tech and off-grid living", "speaker": "Merlin Howse", "description": "A talk looking at Off-Grid Renewable Energy technology and off-grid living.  \r\n\r\nThis presentation is based on 20 years of off-grid living experience and showcases case studies from an off-grid eco-village from 2000 to 2018.  \r\n\r\nThe talk aims to share so"}, {"venue": "Stage C", "start_date": "2024-06-01 10:30:00", "end_date": "2024-06-01 11:00:00", "title": "OMG WTF SSO: A beginner's guide to Single Sign-On (mis)configuration", "speaker": "Adina Bogert-O'Brien", "description": "Single Sign-On (SSO) is sold as a way to\r\n•\tcentralize managing your organization’s users,\r\n•\tmake life easier for your colleagues, and\r\n•\tenforce consistent security standards.\r\nBut SSO protocols are just ways for an identity provider to share informatio"}, {"venue": "Stage A", "start_date": "2024-06-01 10:40:00", "end_date": "2024-06-01 11:10:00", "title": "How volunteers built and are now operating Hydro Power generation on the Thames", "speaker": "Stuart Ward", "description": "This is the story of Reading Hydro, how a group of volunteers built and are now operating a hydro generation plant on the Thames in Reading. From raising the £1.2M to the parts build by volunteers, and how they are now operating the plant. "}, {"venue": "Stage B", "start_date": "2024-06-01 10:40:00", "end_date": "2024-06-01 11:00:00", "title": "Connecting Arduinos to websites: A sequence of chaotic live demos", "speaker": "George Cave", "description": "Controlling websites with an Arduino is like magic. Suddenly little bits of hardware can control all kinds of games and interfaces on screens. And building a UI for your electronics becomes trivial too.\r\n\r\nThis is a talk for anyone who’s ever tinkered wit"}, {"venue": "Stage C", "start_date": "2024-06-01 11:10:00", "end_date": "2024-06-01 11:40:00", "title": "Writing computer code by voice", "speaker": "Michael Arntzenius", "description": "What does a computer programmer do if they can’t type code? Speak it, of course!\r\n\r\nLike many programmers and heavy computer users, I suffer from chronic hand pain aggravated by computer keyboard use (often called repetitive strain injury, or RSI). After "}, {"venue": "Stage A", "start_date": "2024-06-01 11:20:00", "end_date": "2024-06-01 11:50:00", "title": "Gas boilers suck! Hack yours today, save money, save the planet! ", "speaker": "Lee V", "description": "Gas boilers, almost all homes in the UK have them, but they are dreadful!\r\n+90% of the ones I've seen are badly spec'ed and horribly configured, so they burn way too much gas.\r\nThen Martin Lewis keeps telling us to \"lower the flow temperature\" but it's ne"}, {"venue": "Stage B", "start_date": "2024-06-01 11:20:00", "end_date": "2024-06-01 11:50:00", "title": "Are archivists pointless when the cloud can just save everything?", "speaker": "Erinna Cave", "description": "I’m an archivist. Every day I deal with the records that people chose to save, or forgot to destroy. Archival material ranges from the sublime (Royal wills, lost love letters, newspapers announcing the Titanic’s demise) to the ridiculous (broken chips of "}, {"venue": "Stage C", "start_date": "2024-06-01 11:50:00", "end_date": "2024-06-01 12:20:00", "title": "The Tech behind the Tennis - A peek under the hood of a Grand Slam Tennis Tournament", "speaker": "James Sutton ", "description": "For two weeks every summer, half a million people attend the oldest and most prestigious Tennis Tournament, with another billion people following from afar. Underneath the pristine courts of Wimbledon, a massive technology operation underpins almost every"}, {"venue": "Stage A", "start_date": "2024-06-01 12:00:00", "end_date": "2024-06-01 12:40:00", "title": "Digital Skeleton Keys - We’ve got a bone to pick with offline Access Control Systems", "speaker": "Miana", "description": "Offline RFID systems rely on data stored within the key to control access and configuration. But what if a key lies? What if we can make the system trust those lies? Well then we can do some real spooky things…\r\n\r\nThis is the story of how a strange repeat"}, {"venue": "Stage B", "start_date": "2024-06-01 12:00:00", "end_date": "2024-06-01 12:30:00", "title": "London to Brighton, by train and on foot", "speaker": "Emma Charleston", "description": "During the pandemic, trains got weird for a while. We weren’t quite sure whether it was safe to travel collectively, and the impacts of that difficult time continue to shape our railway network to this day. \r\n\r\nMeanwhile, many of us were exploring our own"}, {"venue": "Stage C", "start_date": "2024-06-01 12:30:00", "end_date": "2024-06-01 13:10:00", "title": "Lightning talks  (Saturday)", "speaker": "Thor", "description": "Short 10 minute talks on any topic"}, {"venue": "Stage B", "start_date": "2024-06-01 12:40:00", "end_date": "2024-06-01 13:20:00", "title": "Exploring and extending the Elite game engine for the BBC Micro", "speaker": "Martin Ling", "description": "If you are a British nerd of a certain age, you almost certainly played Elite on the BBC Micro. And if you didn't, this talk will explain why you should care about a now 40-year-old game.\r\n\r\nIt was years ahead of its time, with 3D graphics, a procedurally"}, {"venue": "Stage A", "start_date": "2024-06-01 12:50:00", "end_date": "2024-06-01 13:20:00", "title": "The problem with medical influencers", "speaker": "Rohin Francis", "description": "High carb? High fat? Which fat?\r\nWeights, are you crazy? It's all about cardio!\r\nCardio, are you mad? Weights!\r\nIs Diet Coke giving you cancer? Did seed oils cause your gammy knee? Fruits are bad now? Ground yourself, but air your perineum. Suncream is a "}, {"venue": "Stage C", "start_date": "2024-06-01 13:20:00", "end_date": "2024-06-01 13:50:00", "title": "EverSong - singing voice transfer with Google Magenta’s DDSP + diffusion-based vocoder.", "speaker": "Emily Peasgood & Mark Hanslip", "description": "Emily Peasgood and Mark Hanslip will present a talk on creating EverSong, followed by an invitation to try their vocal transfer models in real-time. \r\n\r\nEverSong is a sound installation where you can hear the lifespan of a person in a song, from 5-years-o"}, {"venue": "Stage A", "start_date": "2024-06-01 13:30:00", "end_date": "2024-06-01 14:00:00", "title": "Hackers, Superheroes, and Super Massive Black Holes: Adventures in Hollywood Visual Effects", "speaker": "Paul Franklin", "description": "Double Oscar winner Paul Franklin talks about his 30 year career in the movies and how he has brought some of modern cinema’s most iconic imagery to the screen."}, {"venue": "Stage B", "start_date": "2024-06-01 13:30:00", "end_date": "2024-06-01 14:00:00", "title": "Influence policing: a view from the cockpit of UK law enforcement’s domestic digital influence campaigns", "speaker": "Ben Collier", "description": "Critical research on digital influence and micro targeting has generally focused on privacy violations by commercial marketers and Cambridge Analytica-style political manipulation. But increasingly, the UK government, police, and security services are usi"}, {"venue": "Stage C", "start_date": "2024-06-01 14:00:00", "end_date": "2024-06-01 14:30:00", "title": "Keeping shell history in sync with turtles and magic", "speaker": "Ellie Huxtable", "description": "Atuin is a command line tool for searching and synchronizing shell history across devices. \r\n\r\nI'll be telling the story of how I accidentally made a popular open source project, diving in to how it synchronizes and encrypts data, and covering some of the"}, {"venue": "Stage A", "start_date": "2024-06-01 14:10:00", "end_date": "2024-06-01 14:50:00", "title": "Keeping on track - the running behaviour of railway vehicles and their safety", "speaker": "Nigel Shaw", "description": "How trains behave dynamically as they run along the track - their running behaviour – is a fundamental to railway safety.\r\n\r\nI am mechanical engineer with 35+ years’ rail industry experience, working in the fields of vehicle design, analysis, and railway "}, {"venue": "Stage B", "start_date": "2024-06-01 14:10:00", "end_date": "2024-06-01 14:40:00", "title": "How to move an industry through influence", "speaker": "Sarah Novotny", "description": "Kubernetes has had a rapid ascent to default cloud infrastructure.  However, this didn’t happen simply because Google open sourced it.  This talk will share the messy human side of the community architecture and how that investment has paid dividends in b"}, {"venue": "Stage C", "start_date": "2024-06-01 14:40:00", "end_date": "2024-06-01 15:10:00", "title": "How to Save a Life", "speaker": "Skylar MacDonald", "description": "You, Eleanor Shellstrop, are dead. You are in cardiac arrest. Your heart has stopped beating, you have stopped breathing, and medically speaking you have died. Not a great start to your day! But worry not: someone has called 999. This talk is the story of"}, {"venue": "Stage B", "start_date": "2024-06-01 14:50:00", "end_date": "2024-06-01 15:20:00", "title": "Hack the Printer! Hack the Printer!", "speaker": "Toby", "description": "We all struggle with getting a printer to actually print something, but the more important issue is how can you play the 1995 classic Hackers on their tiny screen?\r\nWe found a vulnerability on a common office printer that allowed us to run our own code on"}, {"venue": "Stage A", "start_date": "2024-06-01 15:00:00", "end_date": "2024-06-01 15:30:00", "title": "Toys for Elephants", "speaker": "Fiona French", "description": "About the challenges and delights of designing playful interactive systems with elephants currently living in the UK, featuring elephants with brambles, supersize balls, giant sliders and didgeridoos, being curious, affectionate, playful, apprehensive, bo"}, {"venue": "Stage C", "start_date": "2024-06-01 15:20:00", "end_date": "2024-06-01 15:40:00", "title": "Creating searchable Post Office Inquiry transcripts", "speaker": "Matthew Somerville", "description": "The Post Office Horizon IT Inquiry was established in 2020, led by retired high court judge Sir Wyn Williams, to investigate the “failings which occurred with the Horizon IT system at the Post Office leading to the suspension, termination of subpostmaster"}, {"venue": "Stage B", "start_date": "2024-06-01 15:30:00", "end_date": "2024-06-01 16:00:00", "title": "Forgotten graphics technology: the wild workings of the direct-view storage tube CRT", "speaker": "Tom Stepleton", "description": "It's 1975! You need a high-resolution computer display for fine drawings (e.g. CAD diagrams). Memory's EXPENSIVE, processors are slow: what to do? Here's an analog solution to a digital problem: an unusual cathode-ray tube that preserves whatever it draws"}, {"venue": "Stage A", "start_date": "2024-06-01 15:40:00", "end_date": "2024-06-01 16:20:00", "title": "Magic Your Mind Happy", "speaker": "richard wiseman", "description": "Delve into the secret world of wizardry with psychologist and Member of the Inner Magic Circle Professor Richard Wiseman. He reveals how learning magic tricks can boost your confidence, social skills, creativity, happiness and much, much more. Experience "}, {"venue": "Stage C", "start_date": "2024-06-01 15:50:00", "end_date": "2024-06-01 16:10:00", "title": "Geber, Newton, Thoth: What Alchemy Tells Us About Modern Science", "speaker": "🐐", "description": "Alchemy is a misunderstood art. From Hellenistic Egypt through to the modern day, the story of alchemical science teaches us about how science has changed in the last 2000 years and how it has stayed the same. The influence of this ancient science resonat"}, {"venue": "Stage B", "start_date": "2024-06-01 16:10:00", "end_date": "2024-06-01 16:40:00", "title": "Security Theatre", "speaker": "Morgan Hill (pcwizz)", "description": "We will take a peek behind the scenes at the technology used in performing arts venues in order to asses the cyber security implications and how we can address them. A modern performing arts space is no longer several independent systems providing show el"}, {"venue": "Stage C", "start_date": "2024-06-01 16:20:00", "end_date": "2024-06-01 16:50:00", "title": "Women Vs Hollywood", "speaker": "Helen O'Hara", "description": "Why, given that 50% of screenwriters in the silent era were women and that there were quite a few female directors and producers, did women get pushed out of filmmaking and never really come back? What happened in the studio era, and why has nothing chang"}, {"venue": "Stage A", "start_date": "2024-06-01 16:30:00", "end_date": "2024-06-01 17:00:00", "title": "How we make videogames", "speaker": "Ricky Haggett", "description": "I am the creative director and programmer at Hollow Ponds, a videogame development studio. I'm going to briefly show some of our earlier games for context, and then talk about a number of interesting things about the development of our forthcoming game FL"}, {"venue": "Stage B", "start_date": "2024-06-01 16:50:00", "end_date": "2024-06-01 17:20:00", "title": "A Brief History of Calendar Systems and Movable Feasts", "speaker": "John Dalziel", "description": "Join us for a calendrical safari of the weird and wonderful history of Calendar Systems and Movable Feasts. Marvel, as we compute the date of Pancake Day. Gasp, as we gaze on the metric madness of the French Republican calendar. Find out why on earth, the"}, {"venue": "Stage C", "start_date": "2024-06-01 17:00:00", "end_date": "2024-06-01 17:20:00", "title": "Data is plural", "speaker": "Gavin Freeguard", "description": "I once accidentally got YouGov to poll whether it should be ‘the data is’ or ‘the data are’. \r\n\r\nWhether you favour 'are' or 'is', in many ways, data is plural. When we talk about data, we’re talking about different things, contexts, needs, and perspectiv"}, {"venue": "Stage A", "start_date": "2024-06-01 17:10:00", "end_date": "2024-06-01 17:40:00", "title": "The Edible Native Plant Project, or the Fine Line Between Food and Poison", "speaker": "Katherine McLean Forster", "description": "A research project that started with the question, 'what was the average person in Britain eating 500 years ago?', and resulted in a rich knowledge base of over 1200 native and naturalised plants with food uses. The vast majority of our modern foods origi"}, {"venue": "Stage B", "start_date": "2024-06-01 17:30:00", "end_date": "2024-06-01 18:00:00", "title": "Rocket Science For Teenagers", "speaker": "Andy Brice", "description": "Model rocketry is great fun and an excellent way to get young people interested in science and engineering.\r\n\r\nIn 2022 and 2023 I mentored a team of 3 teenagers to enter UKROC, the UK youth rocketry challenge. The team had to design and build a rocket to "}, {"venue": "Stage C", "start_date": "2024-06-01 17:30:00", "end_date": "2024-06-01 18:00:00", "title": "Cobwebs, snowflakes and crows' feet", "speaker": "Pete Owen", "description": "The bicycle wheel is quite possibly the best thing humans have ever invented.\r\nBut then, I would say that - I build them for a living. Come along for a quick ride through their creation, evolution and revolution, a detour through some weird and wonderful "}, {"venue": "Stage A", "start_date": "2024-06-01 17:50:00", "end_date": "2024-06-01 18:20:00", "title": "I Hacked Into My Own Car and other stories", "speaker": "Steve Mould", "description": "I'm not a hacker. But I did manage to unlock my car with a laptop, and I'll show you how to do it. Please don't steal my car afterwards. And I'll show you how I reverse engineered a talking robot toy from the 80s to make it say scary things. And how I pre"}, {"venue": "Stage B", "start_date": "2024-06-01 18:10:00", "end_date": "2024-06-01 18:40:00", "title": "The story of Älgen guitar: how to mix traditional hand-craft woodwork with cutting-edge digital fabrication", "speaker": "Michael Dales", "description": "This talk will take a look at Älgen, a custom-built guitar that is a fusion of traditional hand-crafted woodwork and advanced 3D-printing and generative-design techniques. The guitar is built using no less than 4 different types of 3D-printing, including "}, {"venue": "Stage C", "start_date": "2024-06-01 18:10:00", "end_date": "2024-06-01 18:40:00", "title": "EveryWhere, a regenerative mesh network for communities", "speaker": "Joel Gethin Lewis", "description": "EveryWhere is an open source system for creating mesh networks to allow communities to connect with themselves without having to use commercial systems to do so. Inspired by David Graeber's idea of the sustainable activities of play and care, EveryWhere a"}, {"venue": "Stage A", "start_date": "2024-06-01 18:30:00", "end_date": "2024-06-01 19:20:00", "title": "PowerPoint Karaoke (retro style)", "speaker": "Kate Devlin & Adam Froggatt", "description": "GPT PowerPoint Karaoke in 2022 was a hit — but also GPT was toooooo good at generating the topics. Let’s go retro: HR training manuals, overhead transparencies, terrible diagrams from 1970s Open University TV programmes, and random photographs. Then we ma"}, {"venue": "Stage C", "start_date": "2024-06-01 18:50:00", "end_date": "2024-06-01 19:20:00", "title": "Girls Just Wanna Play Games (and be represented in them)", "speaker": "Lauren Winter", "description": "This talk will take you through a short history of female protagonists in video games, my experience as a female-perceived person playing games, including how this affects my interactions with others, and will finally look at some research to see the theo"}, {"venue": "Stage B", "start_date": "2024-06-01 18:50:00", "end_date": "2024-06-01 19:20:00", "title": "Astrophotography on a budget", "speaker": "David Mills", "description": "I'll cover what you can do with a limited budget; lenses and cameras you already own (your phone for example); and what you might expect to see. I'm not a professional, or even a very talented amateur, but tenacity and the willing to sit out in the dark a"}, {"venue": "Stage B", "start_date": "2024-06-01 19:30:00", "end_date": "2024-06-01 20:00:00", "title": "Up - A Scientist's Guide to the Magic Above Us", "speaker": "Dr Lucy Rogers", "description": "Find joys hidden in plain sight - explore a slice taken from the surface of the Earth up into distant space and discover what we can see. From the glow of a glow-worm to the fuzzy smudge of a distant galaxy, learn where to look and also understand the sci"}, {"venue": "Stage C", "start_date": "2024-06-01 19:30:00", "end_date": "2024-06-01 20:00:00", "title": "How to give your electronic projects a professional looking finish", "speaker": "Peter Miller", "description": "This talk is a ‘how-to’ or recipe to make your electronic projects look professionally finished. It will cover simple graphic design and small-scale metalwork with hand tools. The emphasis is on the techniques useful for personal making and hobby use. \r\n\r"}, {"venue": "Stage A", "start_date": "2024-06-01 19:30:00", "end_date": "2024-06-01 20:30:00", "title": "An Evening of Unnecessary Detail", "speaker": "Matt Parker & Guests", "description": "”An Evening of Unnecessary Detail” is an event where we ask enthusiasts, scientists, and/or comedians to talk about whatever they want. By attending this event, you revoke all rights to complain about the level of detail they choose to do so in."}, {"venue": "Stage C", "start_date": "2024-06-01 20:30:00", "end_date": "2024-06-01 21:10:00", "title": "The Role of Media in Impact Campaigns", "speaker": "Benn Wiebe", "description": "Special event - Talk followed by secret film screening\r\n\r\nWhat do impact campaigns accomplish in the creative landscape, and what is the role and responsibility of the media in driving that social impact? Inspired by the film \"Don't Look Up\", where Benn p"}, {"venue": "Stage B", "start_date": "2024-06-01 20:30:00", "end_date": "2024-06-01 21:25:00", "title": "Electronic Music Open Mic (EMOM) Showcase", "speaker": "EMF Live Music", "description": "Following on from the Electronic Music Open Mic session in Null Sector on Saturday afternoon, a few of the best performers are heading to the big stage to play short ten-minute sets!\r\n\r\nIf you'd like to take part in the afternoon session come along to Nul"}, {"venue": "Stage A", "start_date": "2024-06-01 20:40:00", "end_date": "2024-06-01 22:40:00", "title": "Tiny Whooping A Circus Tent", "speaker": "Andrew Hyams", "description": "This is a workshop by London Aerospace Village\r\nMiniscule FPV racing drones flying round one of the big tents\r\nSmall and safe enough to lose a fight with a party balloon or your face\r\nFast and aerobatic enough to be entertaining (between crashes too!)\r\nCo"}, {"venue": "Stage C", "start_date": "2024-06-01 21:10:00", "end_date": "2024-06-01 23:35:00", "title": "QbagYbbxHc with Benn Wiebe", "speaker": "EMF Film", "description": "Come see a mystery film! We are not allowed to publicise this but we can say it's a fantasic, funny satire on mainstream media and politics. Benn Wiebe, who was an associate producer and climate consultant on \"Don't Look Up\" will deliver an introductory t"}, {"venue": "Stage B", "start_date": "2024-06-01 21:30:00", "end_date": "2024-06-01 22:25:00", "title": "Graham Dunning - Mechanical Techno", "speaker": "EMF Live Music", "description": "Graham Dunning's work explores sound as texture, timbre and something tactile, drawing on bedroom production, tinkering and recycling found objects.\r\n\r\nMechanical Techno uses a standard DJ turntable as a sequencer, sound source and ramshackle engine, buil"}, {"venue": "Stage B", "start_date": "2024-06-01 22:40:00", "end_date": "2024-06-01 23:20:00", "title": "Feral Five and Jonathan Hogg present Truth Is The New Gold ", "speaker": "EMF Live Music", "description": "Dazzling electronic duo Feral Five and artist/technologist Jonathan Hogg present a glittering interactive audiovisual performance of Truth Is The New Gold, unique to EMF.\r\n\r\nUse #emftruth on Mastodon to share your thoughts on truth for the show.\r\n\r\nIt’s a"}, {"venue": "Stage B", "start_date": "2024-06-01 23:30:00", "end_date": "2024-06-02 00:15:00", "title": "Shirobon", "speaker": "EMF Live Music", "description": "I'm Shirobon, I make music using video game consoles and stuff!\r\n\r\nhttps://www.youtube.com/@ShirobonTV/featured\r\nhttps://shirobon.bandcamp.com\r\nhttps://linktr.ee/shirobon"}, {"venue": "Stage C", "start_date": "2024-06-01 23:45:00", "end_date": "2024-06-02 01:40:00", "title": "Colossus: The Forbin Project", "speaker": "EMF Film", "description": "Join us for a brilliant late-night movie, a seventies classic and eerily prescient given the current rise of AI. Thinking this will prevent war, the US government gives an impenetrable supercomputer total control over launching nuclear missiles. But what "}, {"venue": "Stage B", "start_date": "2024-06-02 00:20:00", "end_date": "2024-06-02 01:00:00", "title": "Yaxu - Live coding / auto-live coding", "speaker": "EMF Live Music", "description": "An algorave-style live coding performance from the movement's aging co-founder Yaxu (aka Alex McLean), using the new, accessible and free/open source Strudel live-coding environment (https://strudel.cc). This improvised from-scratch performance will inclu"}, {"venue": "Stage B", "start_date": "2024-06-02 01:05:00", "end_date": "2024-06-02 01:30:00", "title": "Psychiceyeclix ", "speaker": "EMF Live Music", "description": "Psychiceyeclix performs wearing a robot synth helmet using unique instruments & circuit bent devices, using hacked games consoles/toys & diy electronics to create anything from drone, glitch, noise to drum & bass.\r\n\r\nhttps://youtu.be/Kga5pK69WqI?si=3JIkPd"}, {"venue": "Stage A", "start_date": "2024-06-02 09:00:00", "end_date": "2024-06-02 10:00:00", "title": "Stage Volunteer Training", "speaker": "EMF Stage Team", "description": "A training session for people who want to volunteer for stage & video roles, you'll learn how to do basic sound & video mixing, how the cameras work, and how to control the lighting."}, {"venue": "Stage B", "start_date": "2024-06-02 09:00:00", "end_date": "2024-06-02 09:30:00", "title": "Synthercise - the dance fitness experience", "speaker": "zooleika (aka Jo Walsh)", "description": "Get ready to enjoy Synthercise, a dance fitness experience like no other - think \"Zumba, but with chiptunes\". 8-bit sounds, 90s oriented tunes.  \r\n\r\nCome dressed in comfortable clothes, and shoes suitable for dancing and working out in - ready to shake yo"}, {"venue": "Stage A", "start_date": "2024-06-02 10:00:00", "end_date": "2024-06-02 10:30:00", "title": "Lessons learned Open Sourcing the UK's Covid Tracing App", "speaker": "Terence Eden", "description": "On the 7th of May 2020, six-weeks after lockdown was announced, the source code for the UK's COVID-19 contact tracing app was published on GitHub.\r\n\r\nThis is the story of how Open Source helped save lives.\r\n\r\nCome and learn about how we convinced the NHS "}, {"venue": "Stage C", "start_date": "2024-06-02 10:00:00", "end_date": "2024-06-02 10:30:00", "title": "Science Magic...Magic Science", "speaker": "Ian B Dunne", "description": "To spell bind the audience, gasp, wonder and laugh. \r\n\r\nDemonstrations, the eerie strange sound of the theremin and it's analogue, the musical saw. Resonance, levitating objects,  and the occasional funny smell, now accompanied by Robots, Hugi, Tibbles an"}, {"venue": "Stage B", "start_date": "2024-06-02 10:00:00", "end_date": "2024-06-02 10:30:00", "title": "From Makerspace to Outer Space", "speaker": "Neil Monteiro", "description": "Going for a job in the space industry may seem like a moonshot but it's actually much closer than most people think - and a makerspace is a great place to start from. \r\n\r\nI now work in the space industry but began my journey into engineering just six year"}, {"venue": "Stage B", "start_date": "2024-06-02 10:40:00", "end_date": "2024-06-02 11:00:00", "title": "I FOI'd every NHS board in England on autism assessment provision: here's how it went", "speaker": "Georgia Harper", "description": "In December 2023, 172,022 people were waiting for an autism assessment. We know this because NHS England publish quarterly national and regional statistics on the size of the waiting list. What we *don't* know is how long they're waiting for, how many ult"}, {"venue": "Stage C", "start_date": "2024-06-02 10:40:00", "end_date": "2024-06-02 11:00:00", "title": "Practicalities of being a walking lightshow", "speaker": "doop", "description": "Festooning your clothes or costume with lots of glowy lights is fun. Making the glowy lights survive hours or days on end of dancing in sweaty raves or muddy festivals is harder. In this talk I discuss several ways of being a walking lightshow, the unfort"}, {"venue": "Stage A", "start_date": "2024-06-02 10:40:00", "end_date": "2024-06-02 11:10:00", "title": "Unlimited Power: An Engineer's Low-Down on Nuclear Fusion Technology", "speaker": "James Pope", "description": "Most technical people hear about fusion power in the news or see it in games and movies, and are familiar with the joke that it's always 20 years away. Beyond this, it's surprisingly rare to find good information beyond the basic physics and the marketing"}, {"venue": "Stage C", "start_date": "2024-06-02 11:10:00", "end_date": "2024-06-02 11:30:00", "title": "Where is the Art? A history in Technology", "speaker": "Andy Piper", "description": "In October 1971, Frieder Nake published an article in Page, the Bulletin of the Computer Arts Society, entitled \"There Should Be No Computer Art\", making the point that there were more important things for humans to work on together in the late Twentieth "}, {"venue": "Stage B", "start_date": "2024-06-02 11:10:00", "end_date": "2024-06-02 11:40:00", "title": "Making sense of London Underground's timetables and real-time data", "speaker": "Arturs Dobrecovs", "description": "Building on a talk by eta from EMF 2022, this is a deeper dive into how to make use of London Underground's real-time data and hard-to-access timetables to predict a train's future actions.\r\n\r\nI will be going into depth on what is and isn't useful about T"}, {"venue": "Stage A", "start_date": "2024-06-02 11:20:00", "end_date": "2024-06-02 12:10:00", "title": "Activism in Games, plus a Hopepunk RPG (Role-Playing Game)", "speaker": "Jennifer Estaris", "description": "Resistance, systemic change, and our sustainable future can – and must – be playful! To quote the activism artist group Guerilla Girls: “If you can make someone who disagrees with you laugh, you're in their brain, and you can change minds.”\r\n\r\nThe speaker"}, {"venue": "Stage C", "start_date": "2024-06-02 11:40:00", "end_date": "2024-06-02 12:10:00", "title": "Lightning talks  (Sunday)", "speaker": "Thor", "description": "Short 10 minute talks on any topic"}, {"venue": "Stage B", "start_date": "2024-06-02 11:50:00", "end_date": "2024-06-02 12:20:00", "title": "Bringing Any Super 8 Camera Into The Digital Age", "speaker": "Jenny List", "description": "This talk will describe the development process for a digital cartridge to fit any Super 8 home movie camera without any modifications required.\r\n\r\nThere are a huge number of unused 8mm home movie cameras that have been languishing unloved for the last fo"}, {"venue": "Stage A", "start_date": "2024-06-02 12:20:00", "end_date": "2024-06-02 12:50:00", "title": "BIG PIPES! A dive into Scotland's hidden underground hydroelectric infrastructure 🌊", "speaker": "Andrew Simpson", "description": "A look at the history and construction of Scotland's hidden network of remote dams, tunnels, shafts and underground generating stations. Not many are aware of how extensive, ground-breaking, enduring and socially significant the hydro infrastructure hidde"}, {"venue": "Stage C", "start_date": "2024-06-02 12:20:00", "end_date": "2024-06-02 12:50:00", "title": "An engineer’s guide to parenthood", "speaker": "Ella Barrington", "description": "A lot has happened at the other end of life since the last EMF camp; pregnancy, birth and adjusting to life with a tiny human.\r\n\r\nI am an engineer, so when two thin blue lines appeared and I found myself thrown into the chaos of pregnancy and parenthood, "}, {"venue": "Stage B", "start_date": "2024-06-02 12:30:00", "end_date": "2024-06-02 13:00:00", "title": "Getting Started in Laser Cutting", "speaker": "Dominic Morrow", "description": "A presentational workshop with Q&A on getting started in Laser Cutting, diodes vs CO2, water cooling vs RF lasers. What is a Galvo Laser? Where to buy and what to expect? What different controllers are there? Which software exists and which to use for wha"}, {"venue": "Stage C", "start_date": "2024-06-02 13:00:00", "end_date": "2024-06-02 13:50:00", "title": "CERN Technology: Following the White Rabbit down a 27km hole.", "speaker": "Laurence Stant", "description": "How does the most complicated machine in the world work? Why should we pay 16 billion euros to keep some physicists happy with a new toy? What has CERN ever done for us? What happens when you lose control of a beam the size of spaghetti with the energy of"}, {"venue": "Stage A", "start_date": "2024-06-02 13:00:00", "end_date": "2024-06-02 13:30:00", "title": "Don't be evil by accident: algorithmic harms and ethics for technologists", "speaker": "Curtis Parfitt-Ford", "description": "Technologists are wizards. Today, we wield the power to effect changes from a tent, a bedroom or an office the likes of which fifty years ago one might need the power of a small nation-state to accomplish.\r\n\r\nHaving seen these systems from all angles - bu"}, {"venue": "Stage B", "start_date": "2024-06-02 13:10:00", "end_date": "2024-06-02 13:50:00", "title": "Creation of Number", "speaker": "Ben Sparks", "description": "An entertaining journey through humanity’s mathematical attempts to wrestle with the deepest questions behind our day-to-day use of numbers, and their consequences.\r\n\r\nWhere do numbers come from?\r\n\r\nExplore the philosophy of maths behind everyday examples"}, {"venue": "Stage A", "start_date": "2024-06-02 13:40:00", "end_date": "2024-06-02 14:10:00", "title": "Contrary to popular belief, tech needs unions", "speaker": "United Tech & Allied Workers", "description": "It's no secret that the tech sector is notoriously lacking in unionisation compared to more traditional industries; We'd like to talk about why this might be, why it's a bad thing for everyone, and how we might go about fixing it."}, {"venue": "Stage C", "start_date": "2024-06-02 14:00:00", "end_date": "2024-06-02 14:40:00", "title": "Hebocon 2024", "speaker": "Jed Preist", "description": "Hebocon is Robot Wars for those who are not technically gifted, or who would like to stop being technically gifted for a few hours.\r\nTwirling assemblages of junk face off against hot glue monstrosities, whilst some contenders might fail to move at all.\r\n\r"}, {"venue": "Stage B", "start_date": "2024-06-02 14:00:00", "end_date": "2024-06-02 14:30:00", "title": "Hack The Plan: How Being a Nerd-of-all-Trades is a Superpower", "speaker": "Kestral Gaian", "description": "\"So what do you do?\"\r\n\r\nEverything.\r\n\r\n──────────\r\n\r\nAs a kid I couldn't decide what I wanted to be when I grew up.\r\n\r\nI still can't, but over the past twenty years I've turned that into a superpower.\r\n\r\nIn this talk I'll tell you how I hacked the idea of"}, {"venue": "Stage A", "start_date": "2024-06-02 14:20:00", "end_date": "2024-06-02 14:50:00", "title": "Badge Talk", "speaker": "The Badge Team", "description": "In which the badge team have a natter about the tildagon badge, the hexpansion format, the development process, pitfalls and panics along the way."}, {"venue": "Stage B", "start_date": "2024-06-02 14:40:00", "end_date": "2024-06-02 15:20:00", "title": "Astrophysics for Supervillains", "speaker": "Matthew Bothwell", "description": "“Could you crash the Moon into the Earth?”\r\n“If the Sun explodes, would we all get vaporized?”\r\n“What’s the weather like on Mercury?”\r\n\r\nDiscover the answers to these questions (and many more!) at \"Astrophysics for Supervillains\"! Facts about space are al"}, {"venue": "Stage C", "start_date": "2024-06-02 14:50:00", "end_date": "2024-06-02 15:20:00", "title": "Steaming into Sustainability", "speaker": "Ben Hussey", "description": "How do you get several three storey Cornish beam engines, a collection of Grade I listed buildings and a whole network of steam infrastructure on the path towards net zero? This talk is the experience of a volunteer on the practical challenges met whilst "}, {"venue": "Stage A", "start_date": "2024-06-02 15:00:00", "end_date": "2024-06-02 15:30:00", "title": "Living on the canals of the UK - Lessons from the water", "speaker": "mark s brown", "description": "The canals of the UK have undergone transformation from industry to decay to leisure and in recent years to housing. \r\n\r\nIn this talk, we'll go through some of the history of this modern day shanty town along with lessons for any budding boaters consideri"}, {"venue": "Stage C", "start_date": "2024-06-02 15:30:00", "end_date": "2024-06-02 16:00:00", "title": "So You Want To Hack On Rail Data: What's out there, and what can you do with it?", "speaker": "Gaelan Steele", "description": "The British rail industry publishes a lot of open data: there's at least 18 distinct data sources, plus the ones I'm forgetting. This'll be a whirlwind tour of most or all of those sources, with a view at helping people who would be interested in playing "}, {"venue": "Stage B", "start_date": "2024-06-02 15:30:00", "end_date": "2024-06-02 16:00:00", "title": "Does Robot Wars have a Meta? ", "speaker": "Gareth Anstee", "description": "Robot Wars is a TV show that inspired a generation of engineers to take up the sport of \"Robot Combat\", but what drove success in the design of those competing? \r\n\r\nLooking at some famous matches and designs, this talk will break down the rock-paper-sciss"}, {"venue": "Stage A", "start_date": "2024-06-02 15:40:00", "end_date": "2024-06-02 16:20:00", "title": "Explosion in a Tunnel; Understanding Swiss Cheese", "speaker": "Oliver Trojak", "description": "The talk takes a deep-dive into the Abbeystead explosion (using pretty much all available sources available on the subject), one of the worst civil engineering disasters in post-war history, through the lens of the HSE investigation.  It looks at what the"}, {"venue": "Stage B", "start_date": "2024-06-02 16:10:00", "end_date": "2024-06-02 16:40:00", "title": "How to 3D Print A Rocket Engine", "speaker": "Ed Moore", "description": "A talk about the state of the art with metal 3D printing, and how it can let you make rocket engines much more cheaply and quickly than ever before. \r\n\r\nI will briefly describe the anatomy of a rocket engine and why the extreme conditions it must endure m"}, {"venue": "Stage A", "start_date": "2024-06-02 16:30:00", "end_date": "2024-06-02 17:00:00", "title": "Thomas the Privatised Tank Engine 30 years on", "speaker": "Ashley Rolfmore", "description": "It has been 30 years since Private Eye released this biting satire of the privatisation of British Rail.\r\n\r\nToday, the railway system is now part public part private, leaving plenty of confusion for passengers.\r\n\r\nWho runs your local station? Who sets the"}, {"venue": "Stage C", "start_date": "2024-06-02 16:50:00", "end_date": "2024-06-02 17:10:00", "title": "A country you can't put in a box.", "speaker": "Emily Selwood", "description": "A talk about the difficulties of geospatial analysis when the country you are interested is on the edge of the world map. We'll go over some background before showing what happens when you try and draw a box around this country and the issues this causes "}, {"venue": "Stage B", "start_date": "2024-06-02 16:50:00", "end_date": "2024-06-02 17:20:00", "title": "How to get anything from anywhere to anywhere", "speaker": "Robert Nixdorf", "description": "You have an object / art installation/auction purchase and want it somewhere else? What are the options of getting it there without breaking yourself?\r\n\r\nThis will be a short, hopefully entertaining, overview of transport options, their financial and envi"}, {"venue": "Stage A", "start_date": "2024-06-02 17:10:00", "end_date": "2024-06-02 17:40:00", "title": "Driving fancy LED panels with commodity hardware", "speaker": "eta", "description": "Ever wondered about what's behind large advertising billboards? Interested in pretty blinking lights? Curious about electronics and circuit board design? This talk might be for you!\r\n\r\nOur hackspace recently got a donation of ~800 LED matrix panels (squar"}, {"venue": "Stage C", "start_date": "2024-06-02 17:20:00", "end_date": "2024-06-02 17:50:00", "title": "Being Elliot Carver: How to run your own Cable TV station (or network)", "speaker": "Phil Pemberton", "description": "There's nothing good on TV, and streaming curses you with the Paradox of Choice. So why not be Elliot Carver for a day and run your own Cable, satellite or UHF TV station - or even a whole network?\r\nWith a few low-cost computer boards (Raspberry Pi's work"}, {"venue": "Stage A", "start_date": "2024-06-02 18:00:00", "end_date": "2024-06-02 18:40:00", "title": "Infrastructure Review", "speaker": "EMF Team", "description": "Members of the EMF infrastructure teams (network, power, lighting, video, telephony) will talk about how we made the event happen this year. There will be graphs."}, {"venue": "Stage C", "start_date": "2024-06-02 18:00:00", "end_date": "2024-06-02 18:40:00", "title": "Field-FX: Digital art, Demos and Prizegiving", "speaker": "Reality Crossley, Alex Shaw ", "description": "Music and animation, art and code, all come together in a demoscene tradition with a history of over 40 years. It's generative art, storytelling, creative coding and more, with contributors of diverse skill levels from across the globe. We're having a par"}, {"venue": "Stage B", "start_date": "2024-06-02 18:10:00", "end_date": "2024-06-02 18:40:00", "title": "HEU1993 to WHY2025: Dutch hacker camps from the past and the future", "speaker": "Boekenwuurm", "description": "The Dutch hacker camps take place between editions of EMF. They have a long history and a bright future! In this talk the Dutch camps from the past will be visited and the state of the next camp, WHY2025, will be presented. "}, {"venue": "Stage A", "start_date": "2024-06-02 19:00:00", "end_date": "2024-06-02 19:30:00", "title": "Closing ceremony", "speaker": "EMF Team", "description": "The ceremony in which we close the festival. Goodbye!"}, {"venue": "Stage C", "start_date": "2024-06-02 20:00:00", "end_date": "2024-06-02 22:20:00", "title": "The Rubber-Keyed Wonder", "speaker": "EMF Film", "description": "An exclusive for EMF! The Rubber Keyed Wonder is brand-new documentary that  tells the story of the Sinclair ZX Spectrum. This film goes into all the finer details of how and why the ZX Spectrum was created, what impact the computer had as well as the var"}, {"venue": "Stage B", "start_date": "2024-06-02 20:30:00", "end_date": "2024-06-02 21:25:00", "title": "Funki Porcini - Vinyl DJ set", "speaker": "EMF Live Music", "description": "Funki Porcini is composer and film maker James Braddell (a.k.a Giacomo Braddellini). His swirling mixtures of downtempo breaks, smooth ambiance, and disjointed drum'n'bass helped put the London-based Ninja Tune label on the map.\r\n\r\nMake sure you check out"}, {"venue": "Stage B", "start_date": "2024-06-02 21:30:00", "end_date": "2024-06-02 22:10:00", "title": "Vital Organs", "speaker": "EMF Live Music", "description": "Theremin, robotic carillon, sub-bass DIY bagpipes and more in this one-of-a-kind performance from humans Sarah Angliss and Karina Townsend and their extraordinary DIY machines. Hear them conjure birdsong, otherworldly voices and more as their instruments "}, {"venue": "Stage B", "start_date": "2024-06-02 22:25:00", "end_date": "2024-06-02 23:20:00", "title": "Waterflower", "speaker": "Sabine Moore", "description": "Waterflower (Sabine Moore), a Latvian eco-futurist artist, creates raw, grungy electronic pop music using plants and mushrooms as instruments, reflecting on the urgency of our planet's crisis.  Working on themes of ecology, extinction and psychology, Wate"}, {"venue": "Stage C", "start_date": "2024-06-02 22:30:00", "end_date": "2024-06-03 00:00:00", "title": "Silent Running", "speaker": "EMF Film", "description": "The ultimate solarpunk film? In a future Earth barren of all flora and fauna, the planet's ecosystems exist only in large pods attached to spacecraft. When word comes in that the pods are to be jettisoned into space and destroyed, most of the crew of the "}, {"venue": "Stage B", "start_date": "2024-06-02 23:30:00", "end_date": "2024-06-03 00:25:00", "title": "2xAA", "speaker": "EMF Live Music", "description": "A Game Boy Advance fuelled chiptune dance/techno set with custom audio reactive visuals.\r\n\r\nhttps://www.youtube.com/watch?v=EuwgP0WIfLo\r\nhttps://2xaa.net"}]